import React from 'react'
import { Container, Row, Col } from '../../../../components/ui/wrapper'
import Timeline from '../../../../components/ui/timeline-ru'
import ImageOne from '../../../../data/images/bg/machines/placer/rs-1.jpg'
import ImageTwo from '../../../../data/images/bg/machines/placer/rx-7.jpg'
import ImageThree from '../../../../data/images/bg/machines/tht/jm-20.jpg'
import ImageFore from '../../../../data/images/bg/machines/placer/jx-350.jpg'
import { SectionWrap } from './style'


const TimelineArea = (props) => {
    const content = [
        {
            year: "RS",
            image: ImageOne,
            title: "SMART установщики серии RS",
            desc: "Инновационные автоматические установщики SMD электронных компонентов  предназначены для среднесерийного многономенклатурного производства SMT монтажа печатных плат разной сложности. Установщики SMD серии RS  сочетают в себе компактный дизайн и высокое качество процессов установки электронных компонентов. Машины класса Hi-End которые могут быть одновременно и скоростным установщиком chipshooter и прецизионным оборудование для установки сложных и мелких компонентов.",
            path: "/оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/установщик-электронных-компонентов",
            lang: "Подробно..."
        },
        {
            year: "RX",
            image: ImageTwo,
            title: "SPEED установщики серии RX",
            desc: "Скоростные автоматические установщики SMD электронных компонентов серии предназначены для среднесерийного многономенклатурного производства SMT монтажа печатных плат разной сложности и крупносерийного производства для получения максимальной производительности и отдачи линии SMT. Установщики SMD серии RX  являются надежным двигателем производственной линии, который может долго работать на максимальных оборотах. Это оборудование  для крупносерийного производства высококачественных изделий электроники.",
            path: "/оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/скоростной-автомат-установки",
            lang: "Подробно..."
        },
        {
            year: "JM",
            image: ImageThree,
            title: "Multi Task установщики серии JM",
            desc: "Автоматические многозадачные установщики электронных компонентов в отверстия печатных плат (THT) и компонентов поверхностного монтажа (SMD). Предназначены для серийного и крупносерийного производства сборки печатных плат со смешанным монтажом. Оборудование обеспечивает установку сложных по форме компонентов (трансформаторы, экраны, радиаторы и др.) как в отверстия, так и на поверхность печатных плат. Электронные компоненты могут быть в разных упаковках и в россыпи. Оборудование JUKI для установки компонентов устанавливается в стандартную линию SMT и имеет максимальную скорость установки компонентов на рынке данного оборудования.",
            path: "/оборудование-для-монтажа/монтаж-в-отверстия/установщик-компонентов-в-отверстия",
            lang: "Подробно..."
        },
        {
            year: "JX",
            image: ImageFore,
            title: "LED установщики серии JX",
            desc: "Бюджетные установщики SMD электронных компонентов серии предназначены для среднесерийного многономенклатурного производства SMT монтажа печатных плат средней сложности. Не высокая стоимость оборудования дает возможность со старта оснастить производство качественным оборудование от ведущего производителе на рынке. Установщики SMD серии JX устанавливают стандартные компоненты.   Машина специализированная под установку светодиодов  (LED)  и линз на светодиоды . Это оборудование  для серийного производства  изделий электроники и  светодиодного (LED) освещения.",
            path: "/оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/установщик-smd",
            lang: "Подробно..."
        }
    ]
    const contentua = [
        {
            year: "RS",
            image: ImageOne,
            title: "SMART установники серії RS",
            desc: "Інноваційні автоматичні установники SMD електронних компонентів призначені для среднесерійного багатономенклатурного виробництва SMT монтажу друкованих плат різної складності. Установники SMD серії RS поєднують в собі компактний дизайн і високу якість процесів встановлення електронних компонентів. Машини класу Hi-End які можуть бути одночасно і швидкісним установником chipshooter і прецизійним обладнання для встановлення складних і дрібних компонентів.",
            path: "/ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/установник-компонентів",
            lang: "Докладно..."
        },
        {
            year: "RX",
            image: ImageTwo,
            title: "SPEED установники серії RX",
            desc: "Швидкісні автоматичні установники SMD електронних компонентів серії призначені для середньосерійного багатономенклатурного виробництва SMT монтажу друкованих плат різної складності і великосерійного виробництва для отримання максимальної продуктивності і віддачі лінії SMT. Установники SMD серії RX є надійним двигуном виробничої лінії, який може довго працювати на максимальних обертах. Це обладнання для багатосерійного виробництва високоякісних виробів електроніки.",
            path: "/ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/швидкісний-автомат",
            lang: "Докладно..."
        },
        {
            year: "JM",
            image: ImageThree,
            title: "Multi Task установники серії JM",
            desc: "Автоматичні багатозадачні установники електронних компонентів в отворах друкованих плат (THT) та компонентів поверхневого монтажу (SMD). Призначені для серійного та багатосерійного виробництва збирання друкованих плат зі змішаним монтажем. Обладнання забезпечує встановлення складних за формою компонентів (трансформатори, екрани, радіатори та інших.) як у отвори, так і на поверхню друкованих плат. Електронні компоненти можуть бути в різних упаковках та в розсипу. Устаткування JUKI для встановлення компонентів встановлюється у стандартну лінію SMT і має максимальну швидкість встановлення компонентів на ринку цього обладнання.",
            path: "/ua/обладнання-для-монтажу/монтаж-в-отвори/установник-компонентів-в-отвори",
            lang: "Докладно..."
        },
        {
            year: "JX",
            image: ImageFore,
            title: "LED установники серії JX",
            desc: "Бюджетні установники SMD електронних компонентів серії призначені для серійного багатономенклатурного виробництва SMT монтажу друкованих плат середньої складності. Не висока вартість обладнання дає можливість зі старту оснастити виробництво якісним обладнання від провідного виробника на ринку. Установники SMD серії JX встановлюють стандартні компоненти. Машина спеціалізована під встановлення світлодіодів (LED) і лінз на світлодіоди. Це обладнання для серійного виробництва виробів електроніки і світлодіодного (LED) освітлення.",
            path: "/ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/установник-smd",
            lang: "Докладно..."
        }
    ]
    if (props.lang === "ru") {
        return (
            <SectionWrap>
                <Container>
                    <Row>
                    <Col lg={12}>
                           <h5 style={{textAlign: "justify"}}>Оборудование для поверхностного монтажа и монтажа в отверстия печатных плат для установки электронных компонентов SMD и THT от лидирующего мирового производителя оборудования класса Hi-End - JUKI.</h5>
                        </Col>
                        <Col lg={12}>
                            <Timeline items={content} />
                        </Col>
                    </Row>
                </Container>
            </SectionWrap>
        )
    } else if (props.lang === "uk") {
        return (
            <SectionWrap>
                <Container>
                    <Row>
                    <Col lg={12}>
                           <h5 style={{textAlign: "justify"}}>Обладнання для поверхневого монтажу та монтажу в отвори друкованих плат для встановлення електронних компонентів SMD та THT від провідного світового виробника обладнання класу Hi-End - JUKI.</h5>
                        </Col>
                        <Col lg={12}>
                            <Timeline items={contentua} />
                        </Col>
                    </Row>
                </Container>
            </SectionWrap>
        )
    }
}

export default TimelineArea
