import React from 'react'
import { Container, Row, Col } from '../../../../components/ui/wrapper'
import Timeline from '../../../../components/ui/timeline-ru'
import ImageOne from '../../../../data/images/bg/machines/placer/rs-1.jpg'
import ImageTwo from '../../../../data/images/bg/machines/placer/rx-7.jpg'
import ImageThree from '../../../../data/images/bg/machines/placer/fx-3.jpg'
import ImageFore from '../../../../data/images/bg/machines/placer/jx-350.jpg'
import { SectionWrap } from './style'


const TimelineArea = (props) => {
    const content = [
        {
            year: "RS",
            image: ImageOne,
            title: "SMART установщики серии RS",
            desc: "Инновационные автоматические установщики SMD электронных компонентов  предназначены для среднесерийного многономенклатурного производства SMT монтажа печатных плат разной сложности. Установщики SMD серии RS  сочетают в себе компактный дизайн и высокое качество процессов установки электронных компонентов. Машины класса Hi-End которые могут быть одновременно и скоростным установщиком chipshooter и прецизионным оборудование для установки сложных и мелких компонентов.",
            path: "/оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/установщик-электронных-компонентов",
            lang: "Подробно..."
        },
        {
            year: "RX",
            image: ImageTwo,
            title: "SPEED установщики серии RX",
            desc: "Скоростные автоматические установщики SMD электронных компонентов серии предназначены для среднесерийного многономенклатурного производства SMT монтажа печатных плат разной сложности и крупносерийного производства для получения максимальной производительности и отдачи линии SMT. Установщики SMD серии RX  являются надежным двигателем производственной линии, который может долго работать на максимальных оборотах. Это оборудование  для крупносерийного производства высококачественных изделий электроники.",
            path: "/оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/скоростной-автомат-установки",
            lang: "Подробно..."
        },
        {
            year: "FX",
            image: ImageThree,
            title: "CHIP SHOOTER установщики серии FX",
            desc: "Автоматические установщики SMD электронных компонентов предназначены для крупносерийного производства SMT монтажа печатных плат разной сложности. Сверхбыстрое и точное размещение микрокомпонентов на печатных платах. SMD монтажный автомат серии RS сочетает в себе максимальную скорость установки электронных компонентов и высокое качество процессов установки компонентов в CHIP корпусах. Короткое время переоснащения благодаря быстрой замене питающих блоков и минимальное техническое обслуживание. Дружественный интерфейс с сенсорным экраном и мощное программное обеспечение для оптимизации обеспечивают дополнительную простоту использования.",
            path: "/оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/smd-монтажный-автомат",
            lang: "Подробно..."
        },
        {
            year: "JX",
            image: ImageFore,
            title: "LED установщики серии JX",
            desc: "Бюджетные установщики SMD электронных компонентов серии предназначены для среднесерийного многономенклатурного производства SMT монтажа печатных плат средней сложности. Не высокая стоимость оборудования дает возможность со старта оснастить производство качественным оборудование от ведущего производителе на рынке. Установщики SMD серии JX устанавливают стандартные компоненты.   Машина специализированная под установку светодиодов  (LED)  и линз на светодиоды . Это оборудование  для серийного производства  изделий электроники и  светодиодного (LED) освещения.",
            path: "/оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/установщик-smd",
            lang: "Подробно..."
        }
    ]
    const contentua = [
        {
            year: "RS",
            image: ImageOne,
            title: "SMART установники серії RS",
            desc: "Інноваційні автоматичні установники SMD електронних компонентів призначені для среднесерійного багатономенклатурного виробництва SMT монтажу друкованих плат різної складності. Установники SMD серії RS поєднують в собі компактний дизайн і високу якість процесів встановлення електронних компонентів. Машини класу Hi-End які можуть бути одночасно і швидкісним установником chipshooter і прецизійним обладнання для встановлення складних і дрібних компонентів.",
            path: "/ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/установник-електронних-компонентів",
            lang: "Докладно..."
        },
        {
            year: "RX",
            image: ImageTwo,
            title: "SPEED установники серії RX",
            desc: "Швидкісні автоматичні установники SMD електронних компонентів серії призначені для середньосерійного багатономенклатурного виробництва SMT монтажу друкованих плат різної складності і великосерійного виробництва для отримання максимальної продуктивності і віддачі лінії SMT. Установники SMD серії RX є надійним двигуном виробничої лінії, який може довго працювати на максимальних обертах. Це обладнання для багатосерійного виробництва високоякісних виробів електроніки.",
            path: "/ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/швидкісний-автомат-встановлення",
            lang: "Докладно..."
        },
        {
            year: "FX",
            image: ImageThree,
            title: "CHIP SHOOTER установники серії FX",
            desc: "Автоматичні установники SMD електронних компонентів призначені для багатосерійного виробництва SMT монтажу друкованих плат різної складності. Надшвидке і точне розміщення компонентов на друкованих платах. SMD монтажний автомат серії FX поєднує в собі максимальну швидкість встановлення електронних компонентів і високу якість процесів встановлення компонентів в CHIP корпусах. Короткий час переоснащення завдяки швидкій заміні живильників і мінімальне технічне обслуговування. Дружній інтерфейс з сенсорним екраном і потужне програмне забезпечення для оптимізації забезпечують додаткову простоту використання.",
            path: "/ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/smd-монтажний-автомат",
            lang: "Докладно..."
        },
        {
            year: "JX",
            image: ImageFore,
            title: "LED установники серії JX",
            desc: "Бюджетні установники SMD електронних компонентів серії призначені для серійного багатономенклатурного виробництва SMT монтажу друкованих плат середньої складності. Не висока вартість обладнання дає можливість зі старту оснастити виробництво якісним обладнання від провідного виробника на ринку. Установники SMD серії JX встановлюють стандартні компоненти. Машина спеціалізована під встановлення світлодіодів (LED) і лінз на світлодіоди. Це обладнання для серійного виробництва виробів електроніки і світлодіодного (LED) освітлення.",
            path: "/ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/установник-smd",
            lang: "Докладно..."
        }
    ]
    if (props.lang === "ru") {
        return (
            <SectionWrap>
                <Container>
                    <Row>
                    <Col lg={12}>
                           <h6 style={{textAlign: "justify"}}>Оборудование для поверхностного монтажа для установки электронных компонентов SMD на печатные платы от лидирующего мирового производителя оборудования - JUKI.</h6>
                        </Col>
                        <Col lg={12}>
                            <Timeline items={content} />
                        </Col>
                    </Row>
                </Container>
            </SectionWrap>
        )
    } else if (props.lang === "uk") {
        return (
            <SectionWrap>
                <Container>
                    <Row>
                    <Col lg={12}>
                           <h6 style={{textAlign: "justify"}}>Устаткування для поверхневого монтажу для установки електронних компонентів SMD на друковані плати від лідируючого світового виробника обладнання - JUKI.</h6>
                        </Col>
                        <Col lg={12}>
                            <Timeline items={contentua} />
                        </Col>
                    </Row>
                </Container>
            </SectionWrap>
        )
    }
}

export default TimelineArea
