{"data":{"indexResolutionsJson":{"title":"SMART решения для серийного производства<br/> <span>JUKI Smart Solutions</span>","subtitle":"СБОРКА ЭЛЕКТРОНИКИ"},"allJukiJson":{"edges":[{"node":{"id":"1-placement","entitle":"SMT","uaexcerpt":"Машини для встановлення  SMD від JUKI підходять для різних типів виробництв від дрібних до великих серій. Це оптимальне рішення для компаній яким потрібні надійні і довгострокові рішення.","icon":{"svg":{"publicURL":"/static/90988b4093322c04a879e472d98649ee/placement.svg"}}}},{"node":{"id":"2-insertion","entitle":"SMT","uaexcerpt":"Обладнання для встановлення в отвори плат. JUKI встановлюють різні компоненти складної форми. Висока точність і надійність. Можливість вбудовування в лінії SMT без зниження циклу виробництва.","icon":{"svg":{"publicURL":"/static/20449b5df46490a506147900d757de8b/insertion.svg"}}}},{"node":{"id":"3-printing","entitle":"SMT","uaexcerpt":"Трафаретні принтери JUKI - це машини найвищої якості. Доступні для друкованих плат різних розмірів. Використовуються з обладнанням JUKI для монтажу плат, створюючи SMART рішення для SMT.","icon":{"svg":{"publicURL":"/static/2cedaa6513d055aed2a613065f94fbdd/printing.svg"}}}},{"node":{"id":"4-inspection","entitle":"SMT","uaexcerpt":"Рішення JUKI для інспекції нанесення паяльної пасти (SPI) і автоматичної інспекції монтажу компонентів допоможуть заощадити ресурси і виявляти помилки на ранніх етапах виробництва електроніки.","icon":{"svg":{"publicURL":"/static/a95bb645b4128d6ac0af095e39ef53f8/inspection.svg"}}}},{"node":{"id":"5-storage","entitle":"SMT","uaexcerpt":"JUKI пропонує інтелектуальних рішень для зберігання і підготовки компонентів. Ефективна система комплектування економить час і гроші на протязі всього виробничого процесу складання електронікі.","icon":{"svg":{"publicURL":"/static/3fc843030a81dd6b2086f976374ba741/storage.svg"}}}},{"node":{"id":"6-soldering","entitle":"SMT","uaexcerpt":"Паяльні печі JUKI забезпечують мінімальний відхилення температур на електронних платах. Можливість пайки в азотному середовищі. Мінімальне технічне обслуговування. Інтеграція в систему управління.","icon":{"svg":{"publicURL":"/static/9b5f7d42be40c926ff284b3b59bda98e/soldering.svg"}}}},{"node":{"id":"7-handling","entitle":"SMT","uaexcerpt":"Рішення JUKI по переміщенню плат дозволяють підібрати обладнання під індивідуальні вимоги. Від невеликих виробництв до великих лінійних рішень. Спеціальні пропозиції для нестандартних завдань.","icon":{"svg":{"publicURL":"/static/bbdef4afe631e402e77ceb5367b418d8/handling.svg"}}}},{"node":{"id":"8-software","entitle":"SMT","uaexcerpt":"Програмні рішення JUKI підвищують продуктивність та єффективність виробництва. Модульна концепція програмного забезпечення дозволяє орієнтуватися на індивідуальні вимоги замовників.","icon":{"svg":{"publicURL":"/static/e38e76903c5f51a9bc4c1894c835b064/software.svg"}}}}]}}}