{"data":{"indexResolutionsJson":{"title":"SMART решения для серийного производства<br/> <span>JUKI Smart Solutions</span>","subtitle":"СБОРКА ЭЛЕКТРОНИКИ"},"allJukiJson":{"edges":[{"node":{"id":"1-placement","entitle":"SMT","enexcerpt":"JUKI SMT mounters are suitable for different types of production from small to mass production. It is the optimal solution for companies looking for reliable and long-term assembly solutions.","icon":{"svg":{"publicURL":"/static/90988b4093322c04a879e472d98649ee/placement.svg"}}}},{"node":{"id":"2-insertion","entitle":"THT","enexcerpt":"The best insertion Solution on the market. Machine can mount a lot of components on PCB. High precision and reliability. Highest Speed. Integration into SMT lines without cycle reduction.","icon":{"svg":{"publicURL":"/static/20449b5df46490a506147900d757de8b/insertion.svg"}}}},{"node":{"id":"3-printing","entitle":"Printing","enexcerpt":"JUKI stencil printers are machines of the highest quality. Available for various PCB sizes. Used with JUKI mounters, with JUKI soldering ovens, creating SMART SMT solutions.","icon":{"svg":{"publicURL":"/static/2cedaa6513d055aed2a613065f94fbdd/printing.svg"}}}},{"node":{"id":"4-inspection","entitle":"Inspection","enexcerpt":"JUKI solutions for Solder Paste Inspection (SPI) and Automatic Optical Inspection (AOI) can save resources and find defects in the early stages of the electronics manufacturing process.","icon":{"svg":{"publicURL":"/static/a95bb645b4128d6ac0af095e39ef53f8/inspection.svg"}}}},{"node":{"id":"5-storage","entitle":"Storage","enexcerpt":"JUKI offers intelligent storage solutions for components. An intelligent and efficient storage management saves time and money throughout the entire production process.","icon":{"svg":{"publicURL":"/static/3fc843030a81dd6b2086f976374ba741/storage.svg"}}}},{"node":{"id":"6-soldering","entitle":"Reflow","enexcerpt":"JUKI brazing ovens ensure the minimum temperature variation on electronic assemblies. Soldering in nitrogen atmosphere. Minimal maintenance. Integration into the management system.","icon":{"svg":{"publicURL":"/static/9b5f7d42be40c926ff284b3b59bda98e/soldering.svg"}}}},{"node":{"id":"7-handling","entitle":"Handling","enexcerpt":"JUKI's board handling solution allows you to customize the equipment to your individual requirements. From small production facilities to big line solutions. Special offers for non-standard tasks.","icon":{"svg":{"publicURL":"/static/bbdef4afe631e402e77ceb5367b418d8/handling.svg"}}}},{"node":{"id":"8-software","entitle":"Software","enexcerpt":"JUKI software solutions improve production productivity. The modular software concept allows easy to fit software to individual customer requirements. Continuously improving production processes.","icon":{"svg":{"publicURL":"/static/e38e76903c5f51a9bc4c1894c835b064/software.svg"}}}}]}}}