import React from 'react'
import { Container, Row, Col } from '../../../../components/ui/wrapper'
import Timeline from '../../../../components/ui/timeline-ru'
import ImageOne from '../../../../data/images/bg/machines/smt/aoi/aoi-inline.webp'
import ImageTwo from '../../../../data/images/bg/machines/smt/aoi/aoi-offline.webp'
import { SectionWrap } from './style'


const TimelineArea = (props) => {
    const content = [
        {
            year: "Автомат",
            image: ImageOne,
            title: "Системы инспекции монтажа AOI",
            desc: "Автоматическая оптическая инспекция монтажа применяется для определения дефектов монтажа электронных компонентов на поверхность и в отверстия печатных плат. Системы оптического контроля определяют дефекты пайки, геометрию паянных соединений и читают обозначения компонентов. В условиях мелкосерийного производства применяют настольные машины в условиях серийного производства конвейерные системы в составе линии и как отдельностоящее оборудование.",
            path: "автоматы-установки-компонентов/juki",
            lang: "Подробно..."
        },
        {
            year: "Полу-автомат",
            image: ImageTwo,
            title: "Система оптической инспекции AOI",
            desc: "Полу-автоматические оптические системы инспекции монтажа применяются для определения основных дефектов установки и пайки электронных компонентов. Используются в условиях мелкосерийного и серийного многономенклатурного производства. Рекомендуется для изделий с высокими требованиями в эксплуатации. Так же часто применяется контрактными производителями для небольших заказов для инспекции монтажа компонентов (AOI)",
            path: "автоматы-установки-компонентов/juki",
            lang: "Подробно..."
        }
    ]
    const contentua = [
        {
            year: "SPI",
            image: ImageOne,
            title: "Система 3D інспекції",
            desc: "Високоточна система швидкісної автоматичною інспекції 3D нанесення паяльної пасти на друковані плати, як для роботи в лінії SMT, так і для роботи поза лінією в конфігурації SPI Island. Устаткування може зав'язуватися з автоматом для нанесення паяльної пасти. Система інспекції паяльної пасти визначає дефекти нанесення і передає дані похибки на автоматичний принтер для внесення коригувань в технологічні параметри нанесення паяльної пасти. Інноваційний програмне забезпечення і система обробки статистичних даних.",
            path: "автоматы-установки-компонентов/juki",
            lang: "Докладно..."
        },
        {
            year: "SPI",
            image: ImageTwo,
            title: "Система 3D інспекції",
            desc: "Високоточна система швидкісної автоматичною інспекції 3D нанесення паяльної пасти на друковані плати, як для роботи в лінії SMT, так і для роботи поза лінією в конфігурації SPI Island. Устаткування може зав'язуватися з автоматом для нанесення паяльної пасти. Система інспекції паяльної пасти визначає дефекти нанесення і передає дані похибки на автоматичний принтер для внесення коригувань в технологічні параметри нанесення паяльної пасти. Інноваційний програмне забезпечення і система обробки статистичних даних.",
            path: "автоматы-установки-компонентов/juki",
            lang: "Докладно..."
        }
    ]
    if (props.lang === "ru") {
        return (
            <SectionWrap>
                <Container>
                    <Row>
                    <Col lg={12}>
                           <h6 style={{textAlign: "justify"}}>Автоматическая оптическая инспекция – передовое решение для технологических процессов управления качеством и показатель высокого уровня организации производства. Системы применяются  для контроля установки и монтажа электронных компонентов (AOI). По принципу работы оборудование AOI делится на два основных типа: сканирующие на базе сканера – 2D и видео на базе видеокамер – 3D. Системы могут иметь настольное исполнение для мелкосерийного производства и конвейерную конструкцию для работы в линии. Конвейерные машины совместно с устройствами загрузки / выгрузки плат могут составлять линиию AOI для автономного обслуживания несколько производственных линий. Автоматическая оптическая инспекция позволяет полность исключить человеческий фактор и  существенно снижает уровень брака на ранних стадия производства изделия.</h6>
                        </Col>
                        <Col lg={12}>
                            <Timeline items={content} />
                        </Col>
                    </Row>
                </Container>
            </SectionWrap>
        )
    } else if (props.lang === "ua") {
        return (
            <SectionWrap>
                <Container>
                    <Row>
                    <Col lg={12}>
                           <h6 style={{textAlign: "justify"}}>Автоматична оптична інспекція паяльної пасти (SPI) застосовується для визначення дефектів друку паяльної пасти, оптимізації процесу нанесення паяльної пасти на контактні площадки і коригування роботи обладнання для нанесення паяльної пасти. Обладнання встановлюється в лінії поверхневого монтажу (SMT) після принтера нанесення паяльної пасти. Машина може експлуатуватися, як окреме обладнання. Системи автоматичного інспекції нанесення паяльної пасти RV-2 від JUKI застосовують інноваційну технологію 3D інспекції нанесення паяльної пасти. Обладнання і враховує всі потреби Замовників, від дрібносерійного до багато серійного виробництв для будь-якого типу вироби.</h6>
                        </Col>
                        <Col lg={12}>
                            <Timeline items={contentua} />
                        </Col>
                    </Row>
                </Container>
            </SectionWrap>
        )
    }
}

export default TimelineArea
