import React from 'react'
import { Container, Row, Col } from '../../../components/ui/wrapper'
import Timeline from '../../../components/ui/timeline-ru'
import ImageOne from '../../../data/images/bg/lines/soft-incoming.jpg'
import ImageTwo from '../../../data/images/bg/lines/soft-storage.jpg'
import ImageThree from '../../../data/images/bg/lines/soft-planing.jpg'
import ImageFour from '../../../data/images/bg/lines/soft-production.jpg'
import ImageFive from '../../../data/images/bg/lines/soft-final.jpg'
import ImageSix from '../../../data/images/bg/lines/soft-quality.jpg'
import { SectionWrap } from './style'


const TimelineArea = (props) => {
    const content = [
        {
            year: "УЧЕТ",
            image: ImageOne,
            title: "Учет электронных компонентов",
            desc: "Автоматическая система учета электронных компонентов сводит к минимуму затраты связанные с учетом электронных компонентов. Сразу после прибытия электронные компоненты регистрируются в системе учета. Используя программное обеспечение JUKI, можно создать уникальный идентификатор или перенять существующий идентификатор из системы ERP / MES.  Уникальный идентификатор будет привязан к данным. С самого начала происходи оптимизация учета компонентов и охватывает весь цикл оборота комплектации во время производства.",
            path: "/комплексные-решения/линия-поверхностного-монтажа/линия-smt-industry-40",
            lang: "Подробно..."
        },
        {
            year: "ХРАНЕНИЕ",
            image: ImageTwo,
            title: "Автоматизированное хранение",
            desc: "Автоматизированные склады электронных компонентов могут существенно увеличь производительность производства за счет снижения к минимуму ошибок связанных с учетом комплектации. Программные решение для хранения комплектации оптимизируют оборот компонентов, производят автоматическое резервирование по проектам, обеспечивает подключение к существующим системам хранения и управления производства. На основе анализа технического задания Заказчика разрабатываются индивидуально решение для автоматизации хранения комплектации.",
            path: "/комплексные-решения/линия-поверхностного-монтажа/линия-smt-industry-40",
            lang: "Подробно..."
        },
        {
            year: "ПОДГОТОВКА",
            image: ImageThree,
            title: "Подготовка производства",
            desc: "Линия для нанесения защитных покрытий по конфигурации напоминает стандартную линию поверхностного монтажа, только без устройства нанесения паяльной пасты. Загрузка плат в линии производят устройства загрузки плат. Далее плата поступает  в машину для селективного нанесения плат. Если нанесение с двух сторон плата переворачивается и попадает во вторую машину для нанесения покрытий. В зависимости от типа защитных покрытий плата попадает в печь с ИК полимеризацией или УФ отверждения.",
            path: "/комплексные-решения/линия-поверхностного-монтажа/линия-smt-industry-40",
            lang: "Подробно..."
        },
        {
            year: "ПРОИЗВОДСТВО",
            image: ImageFour,
            title: "Управление производством",
            desc: "Полное покрытие печатных плат в условиях серийного и крупносерийного производств требует другой организации линии нанесения защитных покрытий. Для таких требований применятся замкнутые линии.  Собранные электронные платы погружаются в емкость с материалом и после этого поступают в камеру полимеризации. Два процесса покрытие плат погружением  и отверждение лака происходят в одной машине.  В зависимости от применяемых материалов могут быть создаваться специальные условия окружающей среды внутри машины (например для силиконовых покрытий)",
            path: "/комплексные-решения/линия-поверхностного-монтажа/линия-smt-industry-40",
            lang: "Подробно..."
        },
        {
            year: "СБОРКА",
            image: ImageFive,
            title: "Управление финальной сборкой",
            desc: "Линия для нанесения защитных покрытий по конфигурации напоминает стандартную линию поверхностного монтажа, только без устройства нанесения паяльной пасты. Загрузка плат в линии производят устройства загрузки плат. Далее плата поступает  в машину для селективного нанесения плат. Если нанесение с двух сторон плата переворачивается и попадает во вторую машину для нанесения покрытий. В зависимости от типа защитных покрытий плата попадает в печь с ИК полимеризацией или УФ отверждения.",
            path: "/комплексные-решения/линия-поверхностного-монтажа/линия-smt-industry-40",
            lang: "Подробно..."
        },
        {
            year: "КАЧЕСТВО",
            image: ImageSix,
            title: "Управление качеством",
            desc: "Полное покрытие печатных плат в условиях серийного и крупносерийного производств требует другой организации линии нанесения защитных покрытий. Для таких требований применятся замкнутые линии.  Собранные электронные платы погружаются в емкость с материалом и после этого поступают в камеру полимеризации. Два процесса покрытие плат погружением  и отверждение лака происходят в одной машине.  В зависимости от применяемых материалов могут быть создаваться специальные условия окружающей среды внутри машины (например для силиконовых покрытий)",
            path: "/комплексные-решения/линия-поверхностного-монтажа/линия-smt-industry-40",
            lang: "Подробно..."
        }
    ]
    const contentua = [
        {
            year: "ОБЛІК",
            image: ImageOne,
            title: "Нанесення методом занурення",
            desc: "Лінія для нанесення захисних покриттів за конфігурацією нагадує стандартну лінію поверхневого монтажу, лише без нанесення паяльної пасти. Завантаження плат у лінію виконують пристрої завантаження плат. Далі плата надходить у машину для селективного нанесення плат. Якщо нанесення з двох сторін плата перевертається та потрапляє у другу машину для нанесення покриттів. Залежно від типу захисних покриттів плата потрапляє в піч з ІЧ полімеризацією або УФ затвердіння.",
            path: "/ua/комплексні-рішення/лінія-поверхневого-монтажу/лінія-smt-industry-40",
            lang: "Докладно..."
        },
        {
            year: "ЗБЕРІГАННЯ",
            image: ImageTwo,
            title: "Автоматичне встановлення компонентів в отвори",
            desc: "Повне покриття друкованих плат в умовах серійного та багатосерійного виробництв потребує іншої організації лінії нанесення захисних покриттів. Для таких вимог застосовуються замкнуті лінії. Зібрані електронні плати занурюються в ємність із матеріалом і після цього надходять у камеру полімеризації. Два процеси покриття плат зануренням і затвердіння лаку відбуваються в одній машині. Залежно від матеріалів, що застосовуються, можуть бути створені спеціальні умови навколишнього середовища всередині машини (наприклад для силіконових покриттів)",
            path: "/ua/комплексні-рішення/лінія-поверхневого-монтажу/лінія-smt-industry-40",
            lang: "Докладно..."
        },
        {
            year: "ПІДГОТОВКА",
            image: ImageThree,
            title: "Нанесення методом занурення",
            desc: "Лінія для нанесення захисних покриттів за конфігурацією нагадує стандартну лінію поверхневого монтажу, лише без нанесення паяльної пасти. Завантаження плат у лінію виконують пристрої завантаження плат. Далі плата надходить у машину для селективного нанесення плат. Якщо нанесення з двох сторін плата перевертається та потрапляє у другу машину для нанесення покриттів. Залежно від типу захисних покриттів плата потрапляє в піч з ІЧ полімеризацією або УФ затвердіння.",
            path: "/ua/комплексні-рішення/лінія-поверхневого-монтажу/лінія-smt-industry-40",
            lang: "Докладно..."
        },
        {
            year: "ВИРОБНИЦТВО",
            image: ImageFour,
            title: "Автоматичне встановлення компонентів в отвори",
            desc: "Повне покриття друкованих плат в умовах серійного та багатосерійного виробництв потребує іншої організації лінії нанесення захисних покриттів. Для таких вимог застосовуються замкнуті лінії. Зібрані електронні плати занурюються в ємність із матеріалом і після цього надходять у камеру полімеризації. Два процеси покриття плат зануренням і затвердіння лаку відбуваються в одній машині. Залежно від матеріалів, що застосовуються, можуть бути створені спеціальні умови навколишнього середовища всередині машини (наприклад для силіконових покриттів)",
            path: "/ua/комплексні-рішення/лінія-поверхневого-монтажу/лінія-smt-industry-40",
            lang: "Докладно..."
        },
        {
            year: "СКЛАДАННЯ",
            image: ImageFive,
            title: "Нанесення методом занурення",
            desc: "Лінія для нанесення захисних покриттів за конфігурацією нагадує стандартну лінію поверхневого монтажу, лише без нанесення паяльної пасти. Завантаження плат у лінію виконують пристрої завантаження плат. Далі плата надходить у машину для селективного нанесення плат. Якщо нанесення з двох сторін плата перевертається та потрапляє у другу машину для нанесення покриттів. Залежно від типу захисних покриттів плата потрапляє в піч з ІЧ полімеризацією або УФ затвердіння.",
            path: "/ua/комплексні-рішення/лінія-поверхневого-монтажу/лінія-smt-industry-40",
            lang: "Докладно..."
        },
        {
            year: "ЯКІСТЬ",
            image: ImageSix,
            title: "Автоматичне встановлення компонентів в отвори",
            desc: "Повне покриття друкованих плат в умовах серійного та багатосерійного виробництв потребує іншої організації лінії нанесення захисних покриттів. Для таких вимог застосовуються замкнуті лінії. Зібрані електронні плати занурюються в ємність із матеріалом і після цього надходять у камеру полімеризації. Два процеси покриття плат зануренням і затвердіння лаку відбуваються в одній машині. Залежно від матеріалів, що застосовуються, можуть бути створені спеціальні умови навколишнього середовища всередині машини (наприклад для силіконових покриттів)",
            path: "/ua/комплексні-рішення/лінія-поверхневого-монтажу/лінія-smt-industry-40",
            lang: "Докладно..."
        }
    ]
    if (props.lang === "ru") {
        return (
            <SectionWrap>
                <Container>
                    <Row>
                    <Col lg={12}>
                           <h6 style={{textAlign: "justify"}}>Для современного производства и переходу на полною автоматизацию Industry 4.0. уже не достаточно просто купить современное оборудование и обновить парк машин. Чтобы быть готовым к требованиям рынка завтрашнего дня необходимы комплексные решение для производства –  оборудование плюс интеллектуальные и гибкие программные решения. Для организации системы отвечающих вашим требованиям и потребностям необходим надежный партнер.  Программные решения, предоставляемые компанией JUKI, включает в себя отдельные модули для различных задач: учет и хранение компонентов, подготовка и управление производством, оптимизация работы производственных линий, управление финальной сборкой, управление качеством. Программное обеспечение имеет модульную структуру, что обеспечивает максимальную гибкость программных решений.</h6>
                        </Col>
                        <Col lg={12}>
                            <Timeline items={content} />
                        </Col>
                    </Row>
                </Container>
            </SectionWrap>
        )
    } else if (props.lang === "uk") {
        return (
            <SectionWrap>
                <Container>
                    <Row>
                    <Col lg={12}>
                           <h6 style={{textAlign: "justify"}}>Для сучасного виробництва та переходу на повну автоматизацію Industry 4.0. вже мало просто купити сучасне обладнання та оновити парк машин. Щоб бути готовим до вимог ринку завтрашнього дня, необхідні комплексні рішення для виробництва – обладнання плюс інтелектуальні та гнучкі програмні рішення. Для організації системи, що відповідають вашим вимогам та потребам, потрібен надійний партнер. Програмні рішення, що надаються компанією JUKI, включає окремі модулі для різних завдань: облік і зберігання компонентів, підготовка та управління виробництвом, оптимізація роботи виробничих ліній, управління фінальним складанням, управління якістю. Програмне забезпечення має модульну структуру, що забезпечує максимальну гнучкість програмних рішень.</h6>
                        </Col>
                        <Col lg={12}>
                            <Timeline items={contentua} />
                        </Col>
                    </Row>
                </Container>
            </SectionWrap>
        )
    }
}

export default TimelineArea
