
export const PagePath = [
    {
        "id": "machines",
        "ru": "оборудование-для-монтажа",
        "ua": "ua/обладнання-для-монтажу",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-printer",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/принтеры-паяльной-пасты",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/принтери-паяльної-пасти",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-printer-small",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/принтеры-паяльной-пасты/принтеры-пасты-ручные",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/принтери-паяльної-пасти/принтери-пасти-ручні",
        "en": "en/machines",
        "lang": "dadaasds"
    },
    {
        "id": "machines-smt-printer-small-sd240",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/принтеры-паяльной-пасты/принтеры-пасты-ручные/sd240",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/принтери-паяльної-пасти/принтери-пасти-ручні/sd240",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-printer-small-sd300",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/принтеры-паяльной-пасты/принтеры-пасты-ручные/sd300",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/принтери-паяльної-пасти/принтери-пасти-ручні/sd300",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-printer-small-sd360-u",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/принтеры-паяльной-пасты/принтеры-пасты-ручные/sd360-u",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/принтери-паяльної-пасти/принтери-пасти-ручні/sd360-u",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-printer-small-uniprint-s",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/принтеры-паяльной-пасты/принтеры-пасты-ручные/uniprint-s",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/принтери-паяльної-пасти/принтери-пасти-ручні/uniprint-s",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-printer-small-uniprint-v",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/принтеры-паяльной-пасты/принтеры-пасты-ручные/uniprint-v",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/принтери-паяльної-пасти/принтери-пасти-ручні/uniprint-v",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-printer-small-uniprint-m",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/принтеры-паяльной-пасты/принтеры-пасты-ручные/uniprint-m",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/принтери-паяльної-пасти/принтери-пасти-ручні/uniprint-m",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-printer-semi",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/принтеры-паяльной-пасты/полуавтоматический-трафаретный-принтер",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/принтери-паяльної-пасти/напівавтоматичний-трафаретний-принтер",
        "en": "en/machines",
        "lang": "dadaasds"
    },
    {
        "id": "machines-smt-printer-semi-go23",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/принтеры-паяльной-пасты/полуавтоматический-трафаретный-принтер/go23",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/принтери-паяльної-пасти/напівавтоматичний-трафаретний-принтер/go23",
        "en": "en/machines",
        "lang": "dadaasds"
    },
    {
        "id": "machines-smt-printer-semi-go29",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/принтеры-паяльной-пасты/полуавтоматический-трафаретный-принтер/go29",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/принтери-паяльної-пасти/напівавтоматичний-трафаретний-принтер/go29",
        "en": "en/machines",
        "lang": "dadaasds"
    },
    {
        "id": "machines-smt-printer-semi-goled",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/принтеры-паяльной-пасты/полуавтоматический-трафаретный-принтер/goled",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/принтери-паяльної-пасти/напівавтоматичний-трафаретний-принтер/goled",
        "en": "en/machines",
        "lang": "dadaasds"
    },
    {
        "id": "machines-smt-printer-semi-fa23",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/принтеры-паяльной-пасты/полуавтоматический-трафаретный-принтер/fa23",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/принтери-паяльної-пасти/напівавтоматичний-трафаретний-принтер/fa23",
        "en": "en/machines",
        "lang": "dadaasds"
    },
    {
        "id": "machines-smt-printer-auto",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/принтеры-паяльной-пасты/автоматический-принтер-пасты",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/принтери-паяльної-пасти/автоматичний-принтер-пасти",
        "en": "en/machines",
        "lang": "dadaasds"
    },
    {
        "id": "machines-smt-printer-auto-g-titan",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/принтеры-паяльной-пасты/автоматический-принтер-пасты/g-titan",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/принтери-паяльної-пасти/автоматичний-принтер-пасти/g-titan",
        "en": "en/machines",
        "lang": "dadaasds"
    },
    {
        "id": "machines-smt-printer-auto-pmaxii",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/принтеры-паяльной-пасты/автоматический-принтер-пасты/pmaxii",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/принтери-паяльної-пасти/автоматичний-принтер-пасти/pmaxii",
        "en": "en/machines",
        "lang": "dadaasds"
    },
    {
        "id": "machines-smt-printer-auto-p-primo",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/принтеры-паяльной-пасты/автоматический-принтер-пасты/p-primo",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/принтери-паяльної-пасти/автоматичний-принтер-пасти/p-primo",
        "en": "en/machines",
        "lang": "dadaasds"
    },

    {
        "id": "machines-smt-placer",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-manipulator",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/манипулятор-установки-компонентов-smd",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/маніпулятор-встановлення-компонентів-smd",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-manipulator-lm900",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/манипулятор-установки-компонентов-smd/lm900",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/маніпулятор-встановлення-компонентів-smd/lm900",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-manipulator-lm901",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/манипулятор-установки-компонентов-smd/lm901",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/маніпулятор-встановлення-компонентів-smd/lm901",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-manipulator-sm902",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/манипулятор-установки-компонентов-smd/sm902",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/маніпулятор-встановлення-компонентів-smd/sm902",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-manipulator-sm902-professional",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/манипулятор-установки-компонентов-smd/sm902pro",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/маніпулятор-встановлення-компонентів-smd/sm902pro",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-toptable",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/расстановщик-smd",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/розстановник-smd",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-toptable-kayo-a4",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/расстановщик-smd/kayo-a4",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/розстановник-smd/kayo-a4",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-toptable-kayo-d2v-25s",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/расстановщик-smd/kayo-d2v-25s",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/розстановник-smd/kayo-d2v-25s",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-semi",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/автоматические-установщики-smd",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/автоматичні-установники-smd",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-semi-placeall-520",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/автоматические-установщики-smd/placeall-520",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/автоматичні-установники-smd/placeall-520",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-semi-placeall-620",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/автоматические-установщики-smd/placeall-620",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/автоматичні-установники-smd/placeall-620",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-semi-placeall-620l",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/автоматические-установщики-smd/placeall-620l",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/автоматичні-установники-smd/placeall-620l",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-semi-placeall-610xl",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/автоматические-установщики-smd/placeall-610xl",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/автоматичні-установники-smd/placeall-610xl",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-juki",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/установщик-электронных-компонентов",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/установник-електронних-компонентів",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-juki-rs-1",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/установщик-электронных-компонентов/rs-1-juki",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/установник-електронних-компонентів/rs-1-juki",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-juki-rs-1r",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/установщик-электронных-компонентов/rs-1r-juki",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/установник-електронних-компонентів/rs-1r-juki",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-juki-rs-1xl",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/установщик-электронных-компонентов/rs-1xl-juki",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/установник-електронних-компонентів/rs-1xl-juki",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-juki-rx",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/скоростной-автомат-установки",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/швидкісний-автомат-встановлення",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-juki-rx-6",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/скоростной-автомат-установки/rx-6-juki",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/швидкісний-автомат-встановлення/rx-6-juki",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-juki-rx-7",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/скоростной-автомат-установки/rx-7-juki",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/швидкісний-автомат-встановлення/rx-7-juki",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-juki-rx-7r",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/скоростной-автомат-установки/rx-7r-juki",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/швидкісний-автомат-встановлення/rx-7r-juki",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-juki-fx",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/smd-монтажный-автомат",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/smd-монтажний-автомат",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-juki-fx-3",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/smd-монтажный-автомат/fx-3-juki",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/smd-монтажний-автомат/fx-3-juki",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-juki-jx",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/установщик-smd",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/установник-smd",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-juki-jx-350",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/установщик-smd/jx-350-juki",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/установник-smd/jx-350-juki",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-juki-all",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автомат-поверхностного-монтажа",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомат-поверхневого-монтажу",
        "en": "en/machines",
        "lang": ""
    },

    {
        "id": "machines-smt-reflow",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/печи-паяльные/печи-для-пайки-smd",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/печі-паяльні/печі-для-пайки-smd",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-reflow-spide-ha06",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/печи-паяльные/печи-для-пайки-smd/ha06",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/печі-паяльні/печі-для-пайки-smd/ha06",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-reflow-spide-mistral-260",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/печи-паяльные/печи-для-пайки-smd/mistral-260",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/печі-паяльні/печі-для-пайки-smd/mistral-260",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-reflow-spide-mistral-360",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/печи-паяльные/печи-для-пайки-smd/mistral-360",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/печі-паяльні/печі-для-пайки-smd/mistral-360",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-reflow-kayo",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/печи-паяльные/конвекционные-печи-оплавления",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/печі-паяльні/конвекційні-печі-оплавлення",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-reflow-kayo-rf-430",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/печи-паяльные/конвекционные-печи-оплавления/rf-430",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/печі-паяльні/конвекційні-печі-оплавлення/rf-430",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-reflow-kayo-rf-630",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/печи-паяльные/конвекционные-печи-оплавления/rf-630",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/печі-паяльні/конвекційні-печі-оплавлення/rf-630",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-reflow-kayo-rf-835",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/печи-паяльные/конвекционные-печи-оплавления/rf-835",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/печі-паяльні/конвекційні-печі-оплавлення/rf-835",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-reflow-juki",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/печи-паяльные/конвекционная-пайка",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/печі-паяльні/конвекційна-пайка",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-reflow-juki-rs-600",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/печи-паяльные/конвекционная-пайка/rs-600",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/печі-паяльні/конвекційна-пайка/rs-600",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-reflow-juki-rs-800",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/печи-паяльные/конвекционная-пайка/rs-800",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/печі-паяльні/конвекційна-пайка/rs-800",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-reflow-juki-rs-1000",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/печи-паяльные/конвекционная-пайка/rs-1000",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/печі-паяльні/конвекційна-пайка/rs-1000",
        "en": "en/machines",
        "lang": ""
    },




    {
        "id": "machines-smt-reflow",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/печи-паяльные",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/печі-паяльні",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-spi",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/инспекция-паяльной-пасты",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/інспекція-паяльної-пасти",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-aoi",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматическая-оптическая-инспекция",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автоматична-оптична-інспекція",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-conveyer",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/перемещение-печатных-плат",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/переміщення-друкованих-плат",
        "en": "en/machines",
        "lang": ""
    },

    {
        "id": "machines-tht",
        "ru": "оборудование-для-монтажа/монтаж-в-отверстия",
        "ua": "ua/обладнання-для-монтажу/монтаж-в-отвори",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-tht-insertion",
        "ru": "оборудование-для-монтажа/монтаж-в-отверстия/установщик-компонентов-в-отверстия",
        "ua": "ua/обладнання-для-монтажу/монтаж-в-отвори/установник-компонентів-в-отвори",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-tht-insertion-juki-jm-100",
        "ru": "оборудование-для-монтажа/монтаж-в-отверстия/установщик-компонентов-в-отверстия/jm-100-juki",
        "ua": "ua/обладнання-для-монтажу/монтаж-в-отвори/установник-компонентів-в-отвори/jm-100-juki",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-tht-insertion-juki-jm-20",
        "ru": "оборудование-для-монтажа/монтаж-в-отверстия/установщик-компонентов-в-отверстия/jm-20-juki",
        "ua": "ua/обладнання-для-монтажу/монтаж-в-отвори/установник-компонентів-в-отвори/jm-20-juki",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-tht-selective",
        "ru": "оборудование-для-монтажа/монтаж-в-отверстия/селективная-пайка",
        "ua": "ua/обладнання-для-монтажу/монтаж-в-отвори/селективне-паяння",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-tht-selective-off",
        "ru": "оборудование-для-монтажа/монтаж-в-отверстия/установки-селективной-пайки",
        "ua": "ua/обладнання-для-монтажу/монтаж-в-отвори/установки-селективного-паяння",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-tht-selective-off-inertec-cube-460",
        "ru": "оборудование-для-монтажа/монтаж-в-отверстия/установки-селективной-пайки/cube-460",
        "ua": "ua/обладнання-для-монтажу/монтаж-в-отвори/установки-селективного-паяння/cube-460",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-tht-selective-in",
        "ru": "оборудование-для-монтажа/монтаж-в-отверстия/система-селективной-пайки",
        "ua": "ua/обладнання-для-монтажу/монтаж-в-отвори/система-селективного-паяння",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-tht-selective-inertec-in-cube-inline",
        "ru": "оборудование-для-монтажа/монтаж-в-отверстия/система-селективной-пайки/cube-inline",
        "ua": "ua/обладнання-для-монтажу/монтаж-в-отвори/система-селективного-паяння/cube-inline",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-tht-selective-entry",
        "ru": "оборудование-для-монтажа/монтаж-в-отверстия/оборудование-для-селективной-пайки",
        "ua": "ua/обладнання-для-монтажу/монтаж-в-отвори/обладнання-для-селективної-пайки",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-tht-selective-entry-top-375ce",
        "ru": "оборудование-для-монтажа/монтаж-в-отверстия/оборудование-для-селективной-пайки/top-375ce",
        "ua": "ua/обладнання-для-монтажу/монтаж-в-отвори/обладнання-для-селективної-пайки/top-375ce",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-tht-wave",
        "ru": "оборудование-для-монтажа/монтаж-в-отверстия/пайка-волной-припоя",
        "ua": "ua/обладнання-для-монтажу/монтаж-в-отвори/пайка-хвилею-припою",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-tht-wave-entry",
        "ru": "оборудование-для-монтажа/монтаж-в-отверстия/установки-пайки-волной",
        "ua": "ua/обладнання-для-монтажу/монтаж-в-отвори/установки-паяння-хвилею",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-tht-wave-entry-core-sig",
        "ru": "оборудование-для-монтажа/монтаж-в-отверстия/установки-пайки-волной/core-sig",
        "ua": "ua/обладнання-для-монтажу/монтаж-в-отвори/установки-паяння-хвилею/core-sig",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-tht-wave-entry-miniwaver-sig",
        "ru": "оборудование-для-монтажа/монтаж-в-отверстия/установки-пайки-волной/miniwaver-sig",
        "ua": "ua/обладнання-для-монтажу/монтаж-в-отвори/установки-паяння-хвилею/miniwaver-sig",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-inspection-spi",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/инспекция-паяльной-пасты/инспекция-нанесения-паяльной-пасты",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/інспекція-паяльної-пасти/інспекція-нанесення-паяльної-пасти",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-inspection-spi-rv-2",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/инспекция-паяльной-пасты/инспекция-нанесения-паяльной-пасты/rv-2-spi",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/інспекція-паяльної-пасти/інспекція-нанесення-паяльної-пасти/rv-2-spi",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-inspection-spi-rv-2-3dh",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/инспекция-паяльной-пасты/инспекция-нанесения-паяльной-пасты/rv-2-3dh-spi",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/інспекція-паяльної-пасти/інспекція-нанесення-паяльної-пасти/rv-2-3dh-spi",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-inspection-spi-rv-2-3d",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/инспекция-паяльной-пасты/инспекция-нанесения-паяльной-пасты/rv-2-3d-spi",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/інспекція-паяльної-пасти/інспекція-нанесення-паяльної-пасти/rv-2-3d-spi",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-inspection-aoi",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматическая-оптическая-инспекция/системы-автоматической-оптической-инспекции",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автоматична-оптична-інспекція/системи-автоматичної-оптичної-інспекції",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-inspection-aoi-rv-2",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматическая-оптическая-инспекция/системы-автоматической-оптической-инспекции/rv-2-aoi",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автоматична-оптична-інспекція/системи-автоматичної-оптичної-інспекції/rv-2-aoi",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-inspection-aoi-rv-2-3d",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматическая-оптическая-инспекция/системы-автоматической-оптической-инспекции/rv-2-3d-aoi",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автоматична-оптична-інспекція/системи-автоматичної-оптичної-інспекції/rv-2-3d-aoi",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-inspection-aoi-rv-2-3dh",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматическая-оптическая-инспекция/системы-автоматической-оптической-инспекции/rv-2-3dh-aoi",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автоматична-оптична-інспекція/системи-автоматичної-оптичної-інспекції/rv-2-3dh-aoi",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-inspection-aoi-vcta",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматическая-оптическая-инспекция/оптическая-инспекция-печатных-плат",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автоматична-оптична-інспекція/оптична-інспекція-друкованих-плат",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-inspection-aoi-vcta-a410",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматическая-оптическая-инспекция/оптическая-инспекция-печатных-плат/vcta-a410",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автоматична-оптична-інспекція/оптична-інспекція-друкованих-плат/vcta-a410",
        "en": "en/machines",
        "lang": ""
    },

    {
        "id": "machines-smt-loaderunloader",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/перемещение-печатных-плат/загрузчик-разгрузчик-плат",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/переміщення-друкованих-плат/завантажувач-розвантажувач-плат",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-conveyers-mb814-light",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/перемещение-печатных-плат/загрузчик-разгрузчик-плат/mb814",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/переміщення-друкованих-плат/завантажувач-розвантажувач-плат/mb814",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-loaderunloader-mb815-light",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/перемещение-печатных-плат/загрузчик-разгрузчик-плат/mb815",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/переміщення-друкованих-плат/завантажувач-розвантажувач-плат/mb815",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-loaderunloader-mb802",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/перемещение-печатных-плат/загрузчик-разгрузчик-плат/mb802",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/переміщення-друкованих-плат/завантажувач-розвантажувач-плат/mb802",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-loaderunloader-mb801",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/перемещение-печатных-плат/загрузчик-разгрузчик-плат/mb801",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/переміщення-друкованих-плат/завантажувач-розвантажувач-плат/mb801",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-loaderunloader-mb760",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/перемещение-печатных-плат/загрузчик-разгрузчик-плат/mb760",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/переміщення-друкованих-плат/завантажувач-розвантажувач-плат/mb760",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-loaderunloader-mb761",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/перемещение-печатных-плат/загрузчик-разгрузчик-плат/mb716",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/переміщення-друкованих-плат/завантажувач-розвантажувач-плат/mb761",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-loaderunloader-mb817",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/перемещение-печатных-плат/загрузчик-разгрузчик-плат/mb817",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/переміщення-друкованих-плат/завантажувач-розвантажувач-плат/mb817",
        "en": "en/machines",
        "lang": ""
    },

    {
        "id": "machines-smt-conveyer",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/перемещение-печатных-плат/конвейеры-для-печатных-плат",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/переміщення-друкованих-плат/конвеєри-для-друкованих-плат",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-conveyer-lc-light",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/перемещение-печатных-плат/конвейеры-для-печатных-плат/lc",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/переміщення-друкованих-плат/конвеєри-для-друкованих-плат/lc",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-conveyer-mb",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/перемещение-печатных-плат/конвейеры-для-печатных-плат/mb",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/переміщення-друкованих-плат/конвеєри-для-друкованих-плат/mb",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-conveyer-hl",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/перемещение-печатных-плат/конвейеры-для-печатных-плат/hl",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/переміщення-друкованих-плат/конвеєри-для-друкованих-плат/hl",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-conveyer-mb-workstation",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/перемещение-печатных-плат/конвейеры-для-печатных-плат/workstation",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/переміщення-друкованих-плат/конвеєри-для-друкованих-плат/workstation",
        "en": "en/machines",
        "lang": ""
    },

    {
        "id": "machines-smt-buffer",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/перемещение-печатных-плат/конвейерные-системы-для-плат",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/переміщення-друкованих-плат/конвеєрні-системи-для-плат",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-buffer-mb785",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/перемещение-печатных-плат/конвейерные-системы-для-плат/mb785",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/переміщення-друкованих-плат/конвеєрні-системи-для-плат/mb785",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-buffer-mb750",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/перемещение-печатных-плат/конвейерные-системы-для-плат/mb750",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/переміщення-друкованих-плат/конвеєрні-системи-для-плат/mb750",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-buffer-mb805",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/перемещение-печатных-плат/конвейерные-системы-для-плат/mb805",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/переміщення-друкованих-плат/конвеєрні-системи-для-плат/mb805",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-buffer-mb780",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/перемещение-печатных-плат/конвейерные-системы-для-плат/mb780",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/переміщення-друкованих-плат/конвеєрні-системи-для-плат/mb780",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-cleaning",
        "ru": "оборудование-для-монтажа/оборудование-для-мойки",
        "ua": "ua/обладнання-для-монтажу/обладнання-для-миття",
        "en": "en/machines",
        "lang": ""
    },

    {
        "id": "machines-cleaning-pcb",
        "ru": "оборудование-для-монтажа/оборудование-для-мойки/отмывка-печатных-плат",
        "ua": "ua/обладнання-для-монтажу/обладнання-для-миття/відмивання-друкованих-плат",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-cleaning-pcb-hyperswash",
        "ru": "оборудование-для-монтажа/оборудование-для-мойки/отмывка-печатных-плат/hyperswash",
        "ua": "ua/обладнання-для-монтажу/обладнання-для-миття/відмивання-друкованих-плат/hyperswash",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-cleaning-pcb-superswash",
        "ru": "оборудование-для-монтажа/оборудование-для-мойки/отмывка-печатных-плат/superswash",
        "ua": "ua/обладнання-для-монтажу/обладнання-для-миття/відмивання-друкованих-плат/superswash",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-cleaning-pcb-miniswash",
        "ru": "оборудование-для-монтажа/оборудование-для-мойки/отмывка-печатных-плат/miniswash",
        "ua": "ua/обладнання-для-монтажу/обладнання-для-миття/відмивання-друкованих-плат/miniswash",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-cleaning-pcb-compaclean",
        "ru": "оборудование-для-монтажа/оборудование-для-мойки/отмывка-печатных-плат/compaclean",
        "ua": "ua/обладнання-для-монтажу/обладнання-для-миття/відмивання-друкованих-плат/compaclean",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-cleaning-pcb-uniclean",
        "ru": "оборудование-для-монтажа/оборудование-для-мойки/отмывка-печатных-плат/uniclean",
        "ua": "ua/обладнання-для-монтажу/обладнання-для-миття/відмивання-друкованих-плат/uniclean",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-cleaning-pcb-uniclean-xlarge",
        "ru": "оборудование-для-монтажа/оборудование-для-мойки/отмывка-печатных-плат/uniclean-xlarge",
        "ua": "ua/обладнання-для-монтажу/обладнання-для-миття/відмивання-друкованих-плат/uniclean-xlarge",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-cleaning-stencil",
        "ru": "оборудование-для-монтажа/оборудование-для-мойки/отмывка-трафаретов",
        "ua": "ua/обладнання-для-монтажу/обладнання-для-миття/відмивання-трафаретів",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-cleaning-stencil-hyperswash",
        "ru": "оборудование-для-монтажа/оборудование-для-мойки/отмывка-трафаретов/hyperswash",
        "ua": "ua/обладнання-для-монтажу/обладнання-для-миття/відмивання-трафаретів/hyperswash",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-cleaning-stencil-superswash",
        "ru": "оборудование-для-монтажа/оборудование-для-мойки/отмывка-трафаретов/superswash",
        "ua": "ua/обладнання-для-монтажу/обладнання-для-миття/відмивання-трафаретів/superswash",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-cleaning-stencil-miniswash",
        "ru": "оборудование-для-монтажа/оборудование-для-мойки/отмывка-трафаретов/miniswash",
        "ua": "ua/обладнання-для-монтажу/обладнання-для-миття/відмивання-трафаретів/miniswash",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-cleaning-pallete",
        "ru": "оборудование-для-монтажа/оборудование-для-мойки/мойка-паллет-кареток",
        "ua": "ua/обладнання-для-монтажу/обладнання-для-миття/миття-палет-кареток",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-cleaning-pallete-compaclean",
        "ru": "оборудование-для-монтажа/оборудование-для-мойки/мойка-паллет-кареток/compaclean",
        "ua": "ua/обладнання-для-монтажу/обладнання-для-миття/миття-палет-кареток/compaclean",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-cleaning-pallete-fluxclean-t4",
        "ru": "оборудование-для-монтажа/оборудование-для-мойки/мойка-паллет-кареток/fluxclean-t4",
        "ua": "ua/обладнання-для-монтажу/обладнання-для-миття/миття-палет-кареток/fluxclean-t4",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-cleaning-pallete-fluxclean-sd",
        "ru": "оборудование-для-монтажа/оборудование-для-мойки/мойка-паллет-кареток/fluxclean-sd",
        "ua": "ua/обладнання-для-монтажу/обладнання-для-миття/миття-палет-кареток/fluxclean-sd",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-coating-selective",
        "ru": "оборудование-для-монтажа/влагозащита-электроники/селективная-влагозащита",
        "ua": "ua/обладнання-для-монтажу/захист-електроніки/селективний-вологозахист",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-coating-selective-pva-delta-8",
        "ru": "оборудование-для-монтажа/влагозащита-электроники/селективная-влагозащита/delta-8",
        "ua": "ua/обладнання-для-монтажу/захист-електроніки/селективний-вологозахист/delta-8",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-coating-selective-pva-delta-6",
        "ru": "оборудование-для-монтажа/влагозащита-электроники/селективная-влагозащита/delta-6",
        "ua": "ua/обладнання-для-монтажу/захист-електроніки/селективний-вологозахист/delta-6",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-coating-selective-pva-pva350",
        "ru": "оборудование-для-монтажа/влагозащита-электроники/селективная-влагозащита/pva350",
        "ua": "ua/обладнання-для-монтажу/захист-електроніки/селективний-вологозахист/pva350",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-coating-selective-pva-sigma",
        "ru": "оборудование-для-монтажа/влагозащита-электроники/селективная-влагозащита/sigma",
        "ua": "ua/обладнання-для-монтажу/захист-електроніки/селективний-вологозахист/sigma",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-coating-dip",
        "ru": "оборудование-для-монтажа/влагозащита-электроники/влагозащита-погружением",
        "ua": "ua/обладнання-для-монтажу/захист-електроніки/вологозахист-зануренням",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-coating-dip-gem3-dc-2000",
        "ru": "оборудование-для-монтажа/влагозащита-электроники/влагозащита-погружением/dc-2000",
        "ua": "ua/обладнання-для-монтажу/захист-електроніки/вологозахист-зануренням/dc-2000",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-coating-dip-gem3-dc-2002",
        "ru": "оборудование-для-монтажа/влагозащита-электроники/влагозащита-погружением/dc-2002",
        "ua": "ua/обладнання-для-монтажу/захист-електроніки/вологозахист-зануренням/dc-2002",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-coating-spray",
        "ru": "оборудование-для-монтажа/влагозащита-электроники/нанесение-защитных-покрытий",
        "ua": "ua/обладнання-для-монтажу/захист-електроніки/нанесення-захисних-покриттів",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-coating-spray-mccs-sys-1",
        "ru": "оборудование-для-монтажа/влагозащита-электроники/нанесение-защитных-покрытий/mccs-sys-1",
        "ua": "ua/обладнання-для-монтажу/захист-електроніки/нанесення-захисних-покриттів/mccs-sys-1",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-coating-spray-mccs-sys-2",
        "ru": "оборудование-для-монтажа/влагозащита-электроники/нанесение-защитных-покрытий/mccs-sys-2",
        "ua": "ua/обладнання-для-монтажу/захист-електроніки/нанесення-захисних-покриттів/mccs-sys-2",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-coating-spray-fcs300-r-2lt-h",
        "ru": "оборудование-для-монтажа/влагозащита-электроники/нанесение-защитных-покрытий/fcs300-r-2lt-h",
        "ua": "ua/обладнання-для-монтажу/захист-електроніки/нанесення-захисних-покриттів/fcs300-r-2lt-h",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-cutting",
        "ru": "оборудование-для-монтажа/разделение-групповых-заготовок",
        "ua": "ua/обладнання-для-монтажу/розділення-групових-панелей",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-cutting-cutter",
        "ru": "оборудование-для-монтажа/разделение-групповых-заготовок/устройства-разделения-печатных-плат",
        "ua": "ua/обладнання-для-монтажу/розділення-групових-панелей/пристрої-розділення-друкованих-плат",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-cutting-cutter-maestro-2",
        "ru": "оборудование-для-монтажа/разделение-групповых-заготовок/устройства-разделения-печатных-плат/maestro-2",
        "ua": "ua/обладнання-для-монтажу/розділення-групових-панелей/пристрої-розділення-друкованих-плат/maestro-2",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-cutting-cutter-maestro-2m",
        "ru": "оборудование-для-монтажа/разделение-групповых-заготовок/устройства-разделения-печатных-плат/maestro-2m",
        "ua": "ua/обладнання-для-монтажу/розділення-групових-панелей/пристрої-розділення-друкованих-плат/maestro-2m",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-cutting-cutter-maestro-3e",
        "ru": "оборудование-для-монтажа/разделение-групповых-заготовок/устройства-разделения-печатных-плат/maestro-3e",
        "ua": "ua/обладнання-для-монтажу/розділення-групових-панелей/пристрої-розділення-друкованих-плат/maestro-3e",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-cutting-cutter-maestro-4s",
        "ru": "оборудование-для-монтажа/разделение-групповых-заготовок/устройства-разделения-печатных-плат/maestro-4s",
        "ua": "ua/обладнання-для-монтажу/розділення-групових-панелей/пристрої-розділення-друкованих-плат/maestro-4s",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-cutting-cutter-maestro-5l",
        "ru": "оборудование-для-монтажа/разделение-групповых-заготовок/устройства-разделения-печатных-плат/maestro-5l",
        "ua": "ua/обладнання-для-монтажу/розділення-групових-панелей/пристрої-розділення-друкованих-плат/maestro-5l",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-cutting-cutter-maestro-6",
        "ru": "оборудование-для-монтажа/разделение-групповых-заготовок/устройства-разделения-печатных-плат/maestro-6",
        "ua": "ua/обладнання-для-монтажу/розділення-групових-панелей/пристрої-розділення-друкованих-плат/maestro-6",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-cutting-cutter-hektor-2",
        "ru": "оборудование-для-монтажа/разделение-групповых-заготовок/устройства-разделения-печатных-плат/hektor-2",
        "ua": "ua/обладнання-для-монтажу/розділення-групових-панелей/пристрої-розділення-друкованих-плат/hektor-2",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-cutting-router",
        "ru": "оборудование-для-монтажа/разделение-групповых-заготовок/оборудование-разделения-печатных-плат",
        "ua": "ua/обладнання-для-монтажу/розділення-групових-панелей/обладнання-розділення-друкованих-плат",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-cutting-router-er-6000",
        "ru": "оборудование-для-монтажа/разделение-групповых-заготовок/оборудование-разделения-печатных-плат/er-6000",
        "ua": "ua/обладнання-для-монтажу/розділення-групових-панелей/обладнання-розділення-друкованих-плат/er-6000",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-cutting-router-er-8000",
        "ru": "оборудование-для-монтажа/разделение-групповых-заготовок/оборудование-разделения-печатных-плат/er-8000",
        "ua": "ua/обладнання-для-монтажу/розділення-групових-панелей/обладнання-розділення-друкованих-плат/er-8000",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-cutting-laser",
        "ru": "оборудование-для-монтажа/разделение-групповых-заготовок/разделение-групповых-заготовок-лазером",
        "ua": "ua/обладнання-для-монтажу/розділення-групових-панелей/розділення-групових-заготовок-лазером",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-cutting-laser-lba40g",
        "ru": "оборудование-для-монтажа/разделение-групповых-заготовок/разделение-групповых-заготовок-лазером/lba40g",
        "ua": "ua/обладнання-для-монтажу/розділення-групових-панелей/розділення-групових-заготовок-лазером/lba40g",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-cutting-laser-lbb40g",
        "ru": "оборудование-для-монтажа/разделение-групповых-заготовок/разделение-групповых-заготовок-лазером/lbb40g",
        "ua": "ua/обладнання-для-монтажу/розділення-групових-панелей/розділення-групових-заготовок-лазером/lbb40g",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-storage",
        "ru": "оборудование-для-монтажа/автоматизированные-системы-хранения",
        "ua": "ua/обладнання-для-монтажу/автоматизовані-системи-зберігання",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-storage-storage",
        "ru": "оборудование-для-монтажа/автоматизированные-системы-хранения/автоматизированные-склады-компонентов",
        "ua": "ua/обладнання-для-монтажу/автоматизовані-системи-зберігання/автоматизовані-склади-компонентів",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-storage-storage-ism-ultraflex-3600",
        "ru": "оборудование-для-монтажа/автоматизированные-системы-хранения/автоматизированные-склады-компонентов/ism-ultraflex-3600",
        "ua": "ua/обладнання-для-монтажу/автоматизовані-системи-зберігання/автоматизовані-склади-компонентів/ism-ultraflex-3600",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-storage-storage-ism-2000",
        "ru": "оборудование-для-монтажа/автоматизированные-системы-хранения/автоматизированные-склады-компонентов/ism-2000",
        "ua": "ua/обладнання-для-монтажу/автоматизовані-системи-зберігання/автоматизовані-склади-компонентів/ism-2000",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-storage-storage-ism-1800",
        "ru": "оборудование-для-монтажа/автоматизированные-системы-хранения/автоматизированные-склады-компонентов/ism-1800",
        "ua": "ua/обладнання-для-монтажу/автоматизовані-системи-зберігання/автоматизовані-склади-компонентів/ism-1800",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-storage-storage-ism-1100",
        "ru": "оборудование-для-монтажа/автоматизированные-системы-хранения/автоматизированные-склады-компонентов/ism-1100",
        "ua": "ua/обладнання-для-монтажу/автоматизовані-системи-зберігання/автоматизовані-склади-компонентів/ism-1100",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-storage-storage-ism-500",
        "ru": "оборудование-для-монтажа/автоматизированные-системы-хранения/автоматизированные-склады-компонентов/ism-500",
        "ua": "ua/обладнання-для-монтажу/автоматизовані-системи-зберігання/автоматизовані-склади-компонентів/ism-500",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-storage-storage-ism-400",
        "ru": "оборудование-для-монтажа/автоматизированные-системы-хранения/автоматизированные-склады-компонентов/ism-400",
        "ua": "ua/обладнання-для-монтажу/автоматизовані-системи-зберігання/автоматизовані-склади-компонентів/ism-400",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-storage-storage-ism-material-incomin-station",
        "ru": "оборудование-для-монтажа/автоматизированные-системы-хранения/автоматизированные-склады-компонентов/ism-станция-регистрации",
        "ua": "ua/обладнання-для-монтажу/автоматизовані-системи-зберігання/автоматизовані-склади-компонентів/ism-станція-реєстрації",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-storage-dry",
        "ru": "оборудование-для-монтажа/автоматизированные-системы-хранения/шкафы-сухого-хранения",
        "ua": "ua/обладнання-для-монтажу/автоматизовані-системи-зберігання/шафи-сухого-зберігання",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-storage-dry-xsc-300-01",
        "ru": "оборудование-для-монтажа/автоматизированные-системы-хранения/шкафы-сухого-хранения/xsc-300-01",
        "ua": "ua/обладнання-для-монтажу/автоматизовані-системи-зберігання/шафи-сухого-зберігання/xsc-300-01",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-storage-dry-xsc-600-01",
        "ru": "оборудование-для-монтажа/автоматизированные-системы-хранения/шкафы-сухого-хранения/xsc-600-01",
        "ua": "ua/обладнання-для-монтажу/автоматизовані-системи-зберігання/шафи-сухого-зберігання/xsc-600-01",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-storage-dry-xsc-900-01",
        "ru": "оборудование-для-монтажа/автоматизированные-системы-хранения/шкафы-сухого-хранения/xsc-900-01",
        "ua": "ua/обладнання-для-монтажу/автоматизовані-системи-зберігання/шафи-сухого-зберігання/xsc-900-01",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-storage-dry-xtc-510-01",
        "ru": "оборудование-для-монтажа/автоматизированные-системы-хранения/шкафы-сухого-хранения/xtc-510-01",
        "ua": "ua/обладнання-для-монтажу/автоматизовані-системи-зберігання/шафи-сухого-зберігання/xtc-510-01",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-storage-paste",
        "ru": "оборудование-для-монтажа/автоматизированные-системы-хранения/хранение-паяльной-пасты",
        "ua": "ua/обладнання-для-монтажу/автоматизовані-системи-зберігання/зберігання-паяльної-пасти",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-storage-paste-xs-line",
        "ru": "оборудование-для-монтажа/автоматизированные-системы-хранения/хранение-паяльной-пасты/xs-line",
        "ua": "ua/обладнання-для-монтажу/автоматизовані-системи-зберігання/зберігання-паяльної-пасти/xs-line",
        "en": "en/machines",
        "lang": ""
    },


    {
        "id": "machines-coating",
        "ru": "оборудование-для-монтажа/влагозащита-электроники",
        "ua": "ua/обладнання-для-монтажу/захист-електроніки",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-inspection",
        "ru": "оборудование-для-монтажа/оптическая-инспекция",
        "ua": "ua/обладнання-для-монтажу/оптична-інспекція",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-wire",
        "ru": "оборудование-для-монтажа/обработка-провода",
        "ua": "ua/обладнання-для-монтажу/обробка-проводу",
        "en": "en/machines",
        "lang": ""
    },
    
    {
        "id": "lines",
        "ru": "комплексные-решения",
        "ua": "ua/комплексні-рішення",
        "en": "en/lines",
        "lang": ""
    },

    {
        "id": "materials",
        "ru": "материалы-для-smt",
        "ua": "ua/матеріали-для-smt",
        "en": "en/materials",
        "lang": ""
    },
    {
        "id": "materials-solder",
        "ru": "материалы-для-smt/паяльная-паста-и-припой",
        "ua": "ua/матеріали-для-smt/матеріали-для-паяння",
        "en": "en/materials",
        "lang": ""
    },
    {
        "id": "materials-cleaning",
        "ru": "материалы-для-smt/жидкости-для-мойки",
        "ua": "ua/матеріали-для-smt/рідини-для-чищення",
        "en": "en/materials",
        "lang": ""
    },
    {
        "id": "materials-coating",
        "ru": "материалы-для-smt/защитные-покрытия",
        "ua": "ua/матеріали-для-smt/захисні-покриття",
        "en": "en/materials",
        "lang": ""
    },

    {
        "id": "service",
        "ru": "техническое-обслуживание",
        "ua": "ua/технічне-обслуговування",
        "en": "en/service",
        "lang": ""
    }
];