
export const PagePath = [
    {
        "id": "machines",
        "ru": "оборудование-для-монтажа",
        "ua": "ua/обладнання-для-монтажу",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-printer",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/принтеры-паяльной-пасты",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/принтери-паяльної-пасти",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-printer-small",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/принтеры-паяльной-пасты/принтеры-пасты-ручные",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/принтери-паяльної-пасти/принтери-пасти-ручні",
        "en": "en/machines",
        "lang": "dadaasds"
    },
    {
        "id": "machines-smt-printer-small-sd240",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/принтеры-паяльной-пасты/принтеры-пасты-ручные/sd240",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/принтери-паяльної-пасти/принтери-пасти-ручні/sd240",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-printer-small-sd300",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/принтеры-паяльной-пасты/принтеры-пасты-ручные/sd300",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/принтери-паяльної-пасти/принтери-пасти-ручні/sd300",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-printer-small-sd360-u",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/принтеры-паяльной-пасты/принтеры-пасты-ручные/sd360-u",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/принтери-паяльної-пасти/принтери-пасти-ручні/sd360-u",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-printer-small-uniprint-s",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/принтеры-паяльной-пасты/принтеры-пасты-ручные/uniprint-s",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/принтери-паяльної-пасти/принтери-пасти-ручні/uniprint-s",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-printer-small-uniprint-v",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/принтеры-паяльной-пасты/принтеры-пасты-ручные/uniprint-v",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/принтери-паяльної-пасти/принтери-пасти-ручні/uniprint-v",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-printer-small-uniprint-m",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/принтеры-паяльной-пасты/принтеры-пасты-ручные/uniprint-m",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/принтери-паяльної-пасти/принтери-пасти-ручні/uniprint-m",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-printer-semi",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/принтеры-паяльной-пасты/полуавтоматический-трафаретный-принтер",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/принтери-паяльної-пасти/напівавтоматичний-трафаретний-принтер",
        "en": "en/machines",
        "lang": "dadaasds"
    },
    {
        "id": "machines-smt-printer-semi-go23",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/принтеры-паяльной-пасты/полуавтоматический-трафаретный-принтер/go23",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/принтери-паяльної-пасти/напівавтоматичний-трафаретний-принтер/go23",
        "en": "en/machines",
        "lang": "dadaasds"
    },
    {
        "id": "machines-smt-printer-semi-go29",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/принтеры-паяльной-пасты/полуавтоматический-трафаретный-принтер/go29",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/принтери-паяльної-пасти/напівавтоматичний-трафаретний-принтер/go29",
        "en": "en/machines",
        "lang": "dadaasds"
    },
    {
        "id": "machines-smt-printer-semi-goled",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/принтеры-паяльной-пасты/полуавтоматический-трафаретный-принтер/goled",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/принтери-паяльної-пасти/напівавтоматичний-трафаретний-принтер/goled",
        "en": "en/machines",
        "lang": "dadaasds"
    },
    {
        "id": "machines-smt-printer-semi-fa23",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/принтеры-паяльной-пасты/полуавтоматический-трафаретный-принтер/fa23",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/принтери-паяльної-пасти/напівавтоматичний-трафаретний-принтер/fa23",
        "en": "en/machines",
        "lang": "dadaasds"
    },
    {
        "id": "machines-smt-printer-auto",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/принтеры-паяльной-пасты/автоматический-принтер-пасты",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/принтери-паяльної-пасти/автоматичний-принтер-пасти",
        "en": "en/machines",
        "lang": "dadaasds"
    },
    {
        "id": "machines-smt-printer-auto-g-titan",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/принтеры-паяльной-пасты/автоматический-принтер-пасты/g-titan",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/принтери-паяльної-пасти/автоматичний-принтер-пасти/g-titan",
        "en": "en/machines",
        "lang": "dadaasds"
    },
    {
        "id": "machines-smt-printer-auto-pmaxii",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/принтеры-паяльной-пасты/автоматический-принтер-пасты/pmaxii",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/принтери-паяльної-пасти/автоматичний-принтер-пасти/pmaxii",
        "en": "en/machines",
        "lang": "dadaasds"
    },
    {
        "id": "machines-smt-printer-auto-p-primo",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/принтеры-паяльной-пасты/автоматический-принтер-пасты/p-primo",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/принтери-паяльної-пасти/автоматичний-принтер-пасти/p-primo",
        "en": "en/machines",
        "lang": "dadaasds"
    },

    {
        "id": "machines-smt-placer",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-manipulator",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/манипулятор-установки-компонентов-smd",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/маніпулятор-встановлення-компонентів-smd",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-manipulator-lm900",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/манипулятор-установки-компонентов-smd/lm900",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/маніпулятор-встановлення-компонентів-smd/lm900",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-manipulator-lm901",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/манипулятор-установки-компонентов-smd/lm901",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/маніпулятор-встановлення-компонентів-smd/lm901",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-manipulator-sm902",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/манипулятор-установки-компонентов-smd/sm902",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/маніпулятор-встановлення-компонентів-smd/sm902",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-manipulator-sm902-professional",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/манипулятор-установки-компонентов-smd/sm902pro",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/маніпулятор-встановлення-компонентів-smd/sm902pro",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-toptable",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/расстановщик-smd",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/розстановник-smd",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-toptable-kayo-a4",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/расстановщик-smd/kayo-a4",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/розстановник-smd/kayo-a4",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-toptable-kayo-d2v-25s",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/расстановщик-smd/kayo-d2v-25s",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/розстановник-smd/kayo-d2v-25s",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-semi",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/автоматические-установщики-smd",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/автоматичні-установники-smd",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-semi-placeall-520",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/автоматические-установщики-smd/placeall-520",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/автоматичні-установники-smd/placeall-520",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-semi-placeall-620",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/автоматические-установщики-smd/placeall-620",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/автоматичні-установники-smd/placeall-620",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-semi-placeall-620l",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/автоматические-установщики-smd/placeall-620l",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/автоматичні-установники-smd/placeall-620l",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-semi-placeall-610xl",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/автоматические-установщики-smd/placeall-610xl",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/автоматичні-установники-smd/placeall-610xl",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-juki",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/установщик-электронных-компонентов",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/установник-електронних-компонентів",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-juki-rs-1",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/установщик-электронных-компонентов/rs-1-juki",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/установник-електронних-компонентів/rs-1-juki",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-juki-rs-1r",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/установщик-электронных-компонентов/rs-1r-juki",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/установник-електронних-компонентів/rs-1r-juki",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-juki-rs-1xl",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/установщик-электронных-компонентов/rs-1xl-juki",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/установник-електронних-компонентів/rs-1xl-juki",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-juki-rx",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/скоростной-автомат-установки",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/швидкісний-автомат-встановлення",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-juki-rx-6",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/скоростной-автомат-установки/rx-6-juki",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/швидкісний-автомат-встановлення/rx-6-juki",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-juki-rx-7",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/скоростной-автомат-установки/rx-7-juki",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/швидкісний-автомат-встановлення/rx-7-juki",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-juki-rx-7r",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/скоростной-автомат-установки/rx-7r-juki",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/швидкісний-автомат-встановлення/rx-7r-juki",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-juki-fx",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/smd-монтажный-автомат",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/smd-монтажний-автомат",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-juki-fx-3",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/smd-монтажный-автомат/fx-3-juki",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/smd-монтажний-автомат/fx-3-juki",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-juki-jx",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/установщик-smd",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/установник-smd",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-juki-jx-350",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов/установщик-smd/jx-350-juki",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів/установник-smd/jx-350-juki",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-placer-juki-all",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автомат-поверхностного-монтажа",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомат-поверхневого-монтажу",
        "en": "en/machines",
        "lang": ""
    },

    {
        "id": "machines-smt-reflow",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/печи-паяльные/печи-для-пайки-smd",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/печі-паяльні/печі-для-пайки-smd",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-reflow-spide-ha06",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/печи-паяльные/печи-для-пайки-smd/ha06",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/печі-паяльні/печі-для-пайки-smd/ha06",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-reflow-spide-mistral-260",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/печи-паяльные/печи-для-пайки-smd/mistral-260",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/печі-паяльні/печі-для-пайки-smd/mistral-260",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-reflow-spide-mistral-360",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/печи-паяльные/печи-для-пайки-smd/mistral-360",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/печі-паяльні/печі-для-пайки-smd/mistral-360",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-reflow-kayo",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/печи-паяльные/конвекционные-печи-оплавления",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/печі-паяльні/конвекційні-печі-оплавлення",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-reflow-kayo-rf-430",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/печи-паяльные/конвекционные-печи-оплавления/rf-430",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/печі-паяльні/конвекційні-печі-оплавлення/rf-430",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-reflow-kayo-rf-630",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/печи-паяльные/конвекционные-печи-оплавления/rf-630",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/печі-паяльні/конвекційні-печі-оплавлення/rf-630",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-reflow-kayo-rf-835",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/печи-паяльные/конвекционные-печи-оплавления/rf-835",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/печі-паяльні/конвекційні-печі-оплавлення/rf-835",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-reflow-juki",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/печи-паяльные/конвекционная-пайка",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/печі-паяльні/конвекційна-пайка",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-reflow-juki-rs-600",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/печи-паяльные/конвекционная-пайка/rs-600",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/печі-паяльні/конвекційна-пайка/rs-600",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-reflow-juki-rs-800",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/печи-паяльные/конвекционная-пайка/rs-800",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/печі-паяльні/конвекційна-пайка/rs-800",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-reflow-juki-rs-1000",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/печи-паяльные/конвекционная-пайка/rs-1000",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/печі-паяльні/конвекційна-пайка/rs-1000",
        "en": "en/machines",
        "lang": ""
    },




    {
        "id": "machines-smt-reflow",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/печи-паяльные",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/печі-паяльні",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-spi",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/инспекция-паяльной-пасты",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/інспекція-паяльної-пасти",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-aoi",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматическая-оптическая-инспекция",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автоматична-оптична-інспекція",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-conveyer",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/перемещение-печатных-плат",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/переміщення-друкованих-плат",
        "en": "en/machines",
        "lang": ""
    },

    {
        "id": "machines-tht",
        "ru": "оборудование-для-монтажа/монтаж-в-отверстия",
        "ua": "ua/обладнання-для-монтажу/монтаж-в-отвори",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-tht-insertion",
        "ru": "оборудование-для-монтажа/монтаж-в-отверстия/установщик-компонентов-в-отверстия",
        "ua": "ua/обладнання-для-монтажу/монтаж-в-отвори/установник-компонентів-в-отвори",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-tht-insertion-juki-jm-100",
        "ru": "оборудование-для-монтажа/монтаж-в-отверстия/установщик-компонентов-в-отверстия/jm-100-juki",
        "ua": "ua/обладнання-для-монтажу/монтаж-в-отвори/установник-компонентів-в-отвори/jm-100-juki",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-tht-insertion-juki-jm-20",
        "ru": "оборудование-для-монтажа/монтаж-в-отверстия/установщик-компонентов-в-отверстия/jm-20-juki",
        "ua": "ua/обладнання-для-монтажу/монтаж-в-отвори/установник-компонентів-в-отвори/jm-20-juki",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-tht-selective",
        "ru": "оборудование-для-монтажа/монтаж-в-отверстия/селективная-пайка",
        "ua": "ua/обладнання-для-монтажу/монтаж-в-отвори/селективне-паяння",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-tht-selective-off",
        "ru": "оборудование-для-монтажа/монтаж-в-отверстия/установки-селективной-пайки",
        "ua": "ua/обладнання-для-монтажу/монтаж-в-отвори/установки-селективного-паяння",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-tht-selective-off-inertec-cube-460",
        "ru": "оборудование-для-монтажа/монтаж-в-отверстия/установки-селективной-пайки/cube-460",
        "ua": "ua/обладнання-для-монтажу/монтаж-в-отвори/установки-селективного-паяння/cube-460",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-tht-selective-in",
        "ru": "оборудование-для-монтажа/монтаж-в-отверстия/система-селективной-пайки",
        "ua": "ua/обладнання-для-монтажу/монтаж-в-отвори/система-селективного-паяння",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-tht-selective-inertec-in-cube-inline",
        "ru": "оборудование-для-монтажа/монтаж-в-отверстия/система-селективной-пайки/cube-inline",
        "ua": "ua/обладнання-для-монтажу/монтаж-в-отвори/система-селективного-паяння/cube-inline",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-tht-selective-entry",
        "ru": "оборудование-для-монтажа/монтаж-в-отверстия/оборудование-для-селективной-пайки",
        "ua": "ua/обладнання-для-монтажу/монтаж-в-отвори/обладнання-для-селективної-пайки",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-tht-selective-entry-top-375ce",
        "ru": "оборудование-для-монтажа/монтаж-в-отверстия/оборудование-для-селективной-пайки/top-375ce",
        "ua": "ua/обладнання-для-монтажу/монтаж-в-отвори/обладнання-для-селективної-пайки/top-375ce",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-tht-wave",
        "ru": "оборудование-для-монтажа/монтаж-в-отверстия/пайка-волной-припоя",
        "ua": "ua/обладнання-для-монтажу/монтаж-в-отвори/пайка-хвилею-припою",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-tht-wave-entry",
        "ru": "оборудование-для-монтажа/монтаж-в-отверстия/установки-пайки-волной",
        "ua": "ua/обладнання-для-монтажу/монтаж-в-отвори/установки-паяння-хвилею",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-tht-wave-entry-core-sig",
        "ru": "оборудование-для-монтажа/монтаж-в-отверстия/установки-пайки-волной/core-sig",
        "ua": "ua/обладнання-для-монтажу/монтаж-в-отвори/установки-паяння-хвилею/core-sig",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-tht-wave-entry-miniwaver-sig",
        "ru": "оборудование-для-монтажа/монтаж-в-отверстия/установки-пайки-волной/miniwaver-sig",
        "ua": "ua/обладнання-для-монтажу/монтаж-в-отвори/установки-паяння-хвилею/miniwaver-sig",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-inspection-spi",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/инспекция-паяльной-пасты/инспекция-нанесения-паяльной-пасты",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/інспекція-паяльної-пасти/інспекція-нанесення-паяльної-пасти",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-inspection-spi-rv-2",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/инспекция-паяльной-пасты/инспекция-нанесения-паяльной-пасты/rv-2",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/інспекція-паяльної-пасти/інспекція-нанесення-паяльної-пасти/rv-2",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-inspection-spi-rv-2-3dh",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/инспекция-паяльной-пасты/инспекция-нанесения-паяльной-пасты/rv-2-3dh",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/інспекція-паяльної-пасти/інспекція-нанесення-паяльної-пасти/rv-2-3dh",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-inspection-spi-rv-2-3d",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/инспекция-паяльной-пасты/инспекция-нанесения-паяльной-пасты/rv-2-3d",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/інспекція-паяльної-пасти/інспекція-нанесення-паяльної-пасти/rv-2-3d",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-inspection-aoi",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматическая-оптическая-инспекция/системы-автоматической-оптической-инспекции",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автоматична-оптична-інспекція/системи-автоматичної-оптичної-інспекції",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-inspection-aoi-rv-2",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматическая-оптическая-инспекция/системы-автоматической-оптической-инспекции/rv-2",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автоматична-оптична-інспекція/системи-автоматичної-оптичної-інспекції/rv-2",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-inspection-aoi-rv-2-3d",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматическая-оптическая-инспекция/системы-автоматической-оптической-инспекции/rv-2-3d",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автоматична-оптична-інспекція/системи-автоматичної-оптичної-інспекції/rv-2-3d",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-inspection-aoi-rv-2-3dh",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматическая-оптическая-инспекция/системы-автоматической-оптической-инспекции/rv-2-3dh",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автоматична-оптична-інспекція/системи-автоматичної-оптичної-інспекції/rv-2-3dh",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-inspection-aoi-vcta",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматическая-оптическая-инспекция/оптическая-инспекция-печатных-плат",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автоматична-оптична-інспекція/оптична-інспекція-друкованих-плат",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-smt-inspection-aoi-vcta-a410",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматическая-оптическая-инспекция/оптическая-инспекция-печатных-плат/vcta-a410",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автоматична-оптична-інспекція/оптична-інспекція-друкованих-плат/vcta-a410",
        "en": "en/machines",
        "lang": ""
    },


    {
        "id": "machines-cleaning",
        "ru": "оборудование-для-монтажа/оборудование-для-мойки",
        "ua": "ua/обладнання-для-монтажу/обладнання-для-миття",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-coating",
        "ru": "оборудование-для-монтажа/влагозащита-электроники",
        "ua": "ua/обладнання-для-монтажу/захист-електроніки",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-inspection",
        "ru": "оборудование-для-монтажа/оптическая-инспекция",
        "ua": "ua/обладнання-для-монтажу/оптична-інспекція",
        "en": "en/machines",
        "lang": ""
    },
    {
        "id": "machines-wire",
        "ru": "оборудование-для-монтажа/обработка-провода",
        "ua": "ua/обладнання-для-монтажу/обробка-проводу",
        "en": "en/machines",
        "lang": ""
    },
    
    {
        "id": "lines",
        "ru": "комплексные-решения",
        "ua": "ua/комплексні-рішення",
        "en": "en/lines",
        "lang": ""
    },

    {
        "id": "materials",
        "ru": "материалы-для-smt",
        "ua": "ua/матеріали-для-smt",
        "en": "en/materials",
        "lang": ""
    },
    {
        "id": "materials-solder",
        "ru": "материалы-для-smt/паяльная-паста-и-припой",
        "ua": "ua/матеріали-для-smt/матеріали-для-паяння",
        "en": "en/materials",
        "lang": ""
    },
    {
        "id": "materials-cleaning",
        "ru": "материалы-для-smt/жидкости-для-мойки",
        "ua": "ua/матеріали-для-smt/рідини-для-чищення",
        "en": "en/materials",
        "lang": ""
    },
    {
        "id": "materials-coating",
        "ru": "материалы-для-smt/защитные-покрытия",
        "ua": "ua/матеріали-для-smt/захисні-покриття",
        "en": "en/materials",
        "lang": ""
    },

    {
        "id": "service",
        "ru": "техническое-обслуживание",
        "ua": "ua/технічне-обслуговування",
        "en": "en/service",
        "lang": ""
    }
];