
export const PagePath = [
    {
        "id": "machines",
        "ru": "оборудование-для-монтажа",
        "ua": "ua/обладнання-для-монтажу",
        "en": "en/machines"
    },
    {
        "id": "machines-smt",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж",
        "en": "en/machines"
    },
    {
        "id": "machines-smt-printer",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/принтеры-паяльной-пасты",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/принтери-паяльної-пасти",
        "en": "en/machines"
    },
    {
        "id": "machines-smt-placer",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматы-установки-компонентов",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автомати-встановлення-компонентів",
        "en": "en/machines"
    },
    {
        "id": "machines-smt-reflow",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/печи-паяльные",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/печі-паяльні",
        "en": "en/machines"
    },
    {
        "id": "machines-smt-spi",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/инспекция-паяльной-пасты",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/інспекція-паяльної-пасти",
        "en": "en/machines"
    },
    {
        "id": "machines-smt-aoi",
        "ru": "оборудование-для-монтажа/поверхностный-монтаж/автоматическая-оптическая-инспекция",
        "ua": "ua/обладнання-для-монтажу/поверхневий-монтаж/автоматична-оптична-інспекція",
        "en": "en/machines"
    },

    {
        "id": "machines-tht",
        "ru": "оборудование-для-монтажа/монтаж-в-отверстия",
        "ua": "ua/обладнання-для-монтажу/монтаж-в-отвори",
        "en": "en/machines"
    },
    {
        "id": "machines-cleaning",
        "ru": "оборудование-для-монтажа/оборудование-для-мойки",
        "ua": "ua/обладнання-для-монтажу/обладнання-для-миття",
        "en": "en/machines"
    },
    {
        "id": "machines-coating",
        "ru": "оборудование-для-монтажа/влагозащита-электроники",
        "ua": "ua/обладнання-для-монтажу/захист-електроніки",
        "en": "en/machines"
    },
    {
        "id": "machines-inspection",
        "ru": "оборудование-для-монтажа/оптическая-инспекция",
        "ua": "ua/обладнання-для-монтажу/оптична-інспекція",
        "en": "en/machines"
    },
    {
        "id": "machines-wire",
        "ru": "оборудование-для-монтажа/обработка-провода",
        "ua": "ua/обладнання-для-монтажу/обробка-проводу",
        "en": "en/machines"
    },
    
    {
        "id": "lines",
        "ru": "комплексные-решения",
        "ua": "ua/комплексні-рішення",
        "en": "en/lines"
    },

    {
        "id": "materials",
        "ru": "материалы-для-smt",
        "ua": "ua/матеріали-для-smt",
        "en": "en/materials"
    },
    {
        "id": "materials-solder",
        "ru": "материалы-для-smt/паяльная-паста-и-припой",
        "ua": "ua/матеріали-для-smt/матеріали-для-паяння",
        "en": "en/materials"
    },
    {
        "id": "materials-cleaning",
        "ru": "материалы-для-smt/жидкости-для-мойки",
        "ua": "ua/матеріали-для-smt/рідини-для-чищення",
        "en": "en/materials"
    },
    {
        "id": "materials-coating",
        "ru": "материалы-для-smt/защитные-покрытия",
        "ua": "ua/матеріали-для-smt/захисні-покриття",
        "en": "en/materials"
    },

    {
        "id": "service",
        "ru": "техническое-обслуживание",
        "ua": "ua/технічне-обслуговування",
        "en": "en/service"
    }
];