{
    "id": "1-gensonic",
    "path": "оборудование-для-монтажа/оборудование-для-мойки/отмывка-трафаретов/gensonic",
    "pathua": "ua/обладнання-для-монтажу/обладнання-для-миття/відмивання-трафаретів/gensonic",
    "title": "Устройство для чистки",
    "uatitle": "Пристрій для чищення",
    "entitle": "Ultrasonic cleaner",
    "category": "Gensonic",
    "excerpt": "Бюджетная портативная система для ультразвуковой очистки трафаретов для нанесения паяльной пасты. Оборудование можно применять непосредственно на рабочем месте. Устройство позволяет очищать малые апертуры трафарета при минимальном расходе моющих жидкостей.",
    "uaexcerpt": "Бюджетна портативна система для ультразвукового очищення трафаретів для нанесення паяльної пасти. Устаткування можна застосовувати безпосередньо на робочому місці. Пристрій дозволяє очищати малі апертури трафарету при мінімальній витраті миючих рідин.",
    "enexcerpt": "Low-cost, portable system for ultrasonic cleaning of solder paste stencils. The equipment can be used directly at the workplace. The device allows you to clean apertures of the stencil with a minimum consumption of cleaning fluids.",
    "tagline": "A Freeserve case study on expanding market",
    "logo": "../../images/icons/case-study-04-logo-83x108.png",
    "image": "../../../images/box-image/gensonic.png",
    "slide_image": "../../images/box-image/case-study-slide-image-01.png",
    "is_featured": true,
    "banner_image": "../../images/banner/banner-04.jpg",
    "overview": {
        "heading": "Inventions, literary works, music & design are all intangible assets. The legal right to these ‘creations of the mind’ is Intellectual Property (IP).",
        "short_desc": "The studio was keen to create an identity that would not interfere with any of the existing brands, settling on a helicoid system that can be easily adapted to “work with any colour system”. The studio consulted with the various brands throughout the process. (Source: designweek.co.uk)",
        "tags": ["basic"],
        "client": {
            "name": "Maggie Strickland",
            "designation": "Group Chief Information",
            "company": "Aqua Group"
        }
    }
}