{
    "id": "3-wipes",
    "title": "Безворсовые салфетки",
    "uatitle": "Безворсові серветки",
    "entitle": "Solder paste printer",
    "category": "SMT Stencil Wipes",
    "excerpt": "Безворсовые салфетки для очистки трафаретов для нанесения паяльной пасты. Применяются для очистки трафаретов, для получения четких и качественных отпечатков паяльной пасты и снижения брака после пайки.  Для ручной очистки трафаретов бумага применяется в виде салфеток.",
    "uaexcerpt": "Безворсові серветки для очищення трафаретів для нанесення паяльної пасти. Застосовуються для очищення трафаретів, для отримання чітких і якісних відбитків паяльної пасти і зниження дефектів після пайки. Для ручного чищення трафаретів папір застосовується у вигляді серветок.",
    "enexcerpt": "Lint-free wipes for cleaning SMT stencils for solder paste printing. They are used to clean stencils, to obtain clear and high-quality prints of solder paste and to reduce defects rate after soldering. For manual cleaning of stencils.",
    "tagline": "A Freeserve case study on expanding market",
    "logo": "../../images/icons/case-study-04-logo-83x108.png",
    "image": "../../../images/box-image/stencil-wipes.png",
    "slide_image": "../../images/box-image/case-study-slide-image-01.png",
    "is_featured": true,
    "banner_image": "../../images/banner/banner-04.jpg",
    "overview": {
        "heading": "Inventions, literary works, music & design are all intangible assets. The legal right to these ‘creations of the mind’ is Intellectual Property (IP).",
        "short_desc": "The studio was keen to create an identity that would not interfere with any of the existing brands, settling on a helicoid system that can be easily adapted to “work with any colour system”. The studio consulted with the various brands throughout the process. (Source: designweek.co.uk)",
        "tags": ["basic"],
        "client": {
            "name": "Maggie Strickland",
            "designation": "Group Chief Information",
            "company": "Aqua Group"
        }
    }
}