import React from 'react'
import { Container, Row, Col } from '../../../components/ui/wrapper'
import Timeline from '../../../components/ui/timeline-ru'
import ImageOne from '../../../data/images/bg/lines/smt-big-prototyping.jpg'
import ImageTwo from '../../../data/images/bg/lines/smt-big-small.jpg'
import ImageThree from '../../../data/images/bg/lines/smt-big-series.jpg'
import ImageFore from '../../../data/images/bg/lines/smt-big-industry-40.jpg'
import { SectionWrap } from './style'


const TimelineArea = (props) => {
    const content = [
        {
            year: "ПРОТОТИПЫ",
            image: ImageOne,
            title: "Оборудование для прототипирования ",
            desc: "Линия SMT для мелкосерийного производства для производства прототипов включает в себя три основные технологические процессы: нанесение паяльной пасты, установка электронных компонентов на плату, олавление паяльной пасты. Производство прототипов требует высокой гибкости и перехода на новое изделие без дополнительного оборудования и технологической оснастки. Поэтому оборудование для производства прототипов совмещает нанесение паяльной пасты дозатором и установку SMD на одном устройстве. Нанесение паяльной пасты дозатором снижает расходы на изготовление трафаретов.",
            path: "/комплексные-решения/линия-поверхностного-монтажа/линия-smt",
            lang: "Подробно..."
        },
        {
            year: "МАЛАЯ СЕРИЯ",
            image: ImageTwo,
            title: "Оборудование для мелкосерийного производства",
            desc: "Линия SMD монтажа для мелкосерийного производства для производства включает в себя три основные технологические процессы: нанесение паяльной пасты, установка электронных компонентов на печатную плату, оплавление паяльной пасты в печи. Нанесение паяльной пасты осуществляется на простом устройстве трафаретной печати с ручным перемещением ракелей. Для изделий с высокой плотностью монтажа рекомендуются полуавтоматические устройства для нанесения паяльной пасты. Установка электронных компонентов на плату  производится в автоматическом режиме на установщике SMD начального уровня. Оплавление припоя в конвейерной печи начального или среднего уровня.  Оборудование линии SMD монтажа имеет отдельностоящее исполнение или завязывается в линию полностью и частично.",
            path: "/комплексные-решения/линия-поверхностного-монтажа/линия-smd-монтажа",
            lang: "Подробно..."
        },
        {
            year: "СЕРИЙНЫЙ ВЫПУСК",
            image: ImageThree,
            title: "Серийные производственные линии SMT",
            desc: "Линия поверхностного монтажа для серийного производства для производства включает в себя три основные технологические процессы: нанесение паяльной пасты, установка электронных компонентов на печатную плату, оплавление паяльной пасты в печи. Каждый процесс выполняется в автоматическом режиме и все оборудование завязано в линию через конвейеры. Нанесение паяльной пасты осуществляется на автоматическом устройстве трафаретной печати с автоматическим совмещением трафарета и печатной платы. Установка электронных компонентов на плату  производится в автоматическом режиме на установщике SMD конвейерного типа. Оплавление припоя происходит в конвейерной конвекционной печи с системой мониторинга температуры. Для повышения производительности линия может дополнятся устройствами автоматической загрузки/выгрузки печатных плат. Для повышения качества, линия поверхностного монтажа комплектуется устройствами автоматического оптического контроля монтажа (AOI) и автоматической оптической системой контроля нанесения паяльной пасты (SPI).​",
            path: "/комплексные-решения/линия-поверхностного-монтажа/smt-линия-монтажа-плат",
            lang: "Подробно..."
        },
        ,
        {
            year: "Industry 4.0",
            image: ImageFore,
            title: "Внедрения Industry 4.0 на производстве",
            desc: "Industry 4.0 - это термин, обозначающий четвертую промышленную революцию: оцифровку и автоматизацию производства направленную на создание производства без участия человека. Достижения в области сетевых технологий, машинного обучения, анализа данных, робототехники и других технологий значительно улучшают производственные процессы и снижают нашу зависимость от человеческого труда и процесса принятия решений. Используя цифровые решения, производство может уменьшить количество человеческих ошибок и повысить скорость адаптации промышленных процессов к новой информации.",
            path: "/комплексные-решения/линия-поверхностного-монтажа/линия-smt-industry-40",
            lang: "Подробно..."
        }
    ]
    const contentua = [
        {
            year: "ПРОТОТИПУВАННЯ",
            image: ImageOne,
            title: "Обладнання для прототипування",
            desc: "Лінія SMT для дрібносерійного виробництва для виробництва прототипів включає три основні технологічні процеси: нанесення паяльної пасти, встановлення електронних компонентів на плату, плавлення паяльної пасти. Виробництво прототипів вимагає високої гнучкості та переходу на новий виріб без додаткового обладнання та технологічного оснащення. Тому обладнання для виробництва прототипів поєднує нанесення паяльної пасти дозатором та встановлення SMD на одному пристрої. Нанесення паяльної пасти дозатором знижує витрати на виготовлення трафаретів.",
            path: "/ua/комплексні-рішення/лінія-поверхневого-монтажу/лінія-smt",
            lang: "Докладно..."
        },
        {
            year: "МАЛА СЕРІЯ",
            image: ImageTwo,
            title: "Обладнання для дрібносерійного виробництва.",
            desc: "Лінія SMD монтажу для дрібносерійного виробництва для виробництва включає три основні технологічні процеси: нанесення паяльної пасти, встановлення електронних компонентів на друковану плату, оплавлення паяльної пасти в печі. Нанесення паяльної пасти здійснюється на простому пристрої трафаретного друку з ручним переміщенням ракелів. Для виробів з високою щільністю монтажу рекомендуються напівавтоматичні пристрої для нанесення паяльної пасти. Встановлення електронних компонентів на плату здійснюється автоматично на установнику SMD початкового рівня. Оплавлення припою у конвеєрній печі початкового або середнього рівня. Устаткування лінії SMD монтажу має окреме виконання або зав'язується в лінію повністю або частково.",
            path: "/ua/комплексні-рішення/лінія-поверхневого-монтажу/лінія-smd-монтажу",
            lang: "Докладно..."
        },
        {
            year: "СЕРІЙНЕ ВИРОБНИЦТВО",
            image: ImageThree,
            title: "Серійні виробничі лінії SMT",
            desc: "Лінія поверхневого монтажу для серійного виробництва для виробництва включає три основні технологічні процеси: нанесення паяльної пасти, встановлення електронних компонентів на друковану плату, оплавлення паяльної пасти в печі. Кожен процес виконується в автоматичному режимі та все обладнання зав'язане у лінію через конвеєри. Нанесення паяльної пасти здійснюється на автоматичному пристрої трафаретного друку з автоматичним суміщенням трафарету та друкованої плати. Встановлення електронних компонентів на плату здійснюється в автоматичному режимі на установнику SMD конвеєрного типу. Оплавлення припою відбувається у конвеєрній конвекційній печі із системою моніторингу температури. Для підвищення продуктивності лінія може доповнюватись пристроями автоматичного завантаження/розвантаження друкованих плат. Для підвищення якості лінія поверхневого монтажу комплектується пристроями автоматичного оптичного контролю монтажу (AOI) та автоматичною оптичною системою контролю нанесення паяльної пасти (SPI).",
            path: "/ua/комплексні-рішення/лінія-поверхневого-монтажу/smt-лінія-монтажу-плат",
            lang: "Докладно..."
        },
        {
            year: "Industry 4.0",
            image: ImageFore,
            title: "Впровадження Industry 4.0 на виробництві",
            desc: "Industry 4.0 - це термін, що означає четверту промислову революцію: оцифрування та автоматизацію виробництва спрямовану створення виробництва без участі людини. Досягнення в галузі мережевих технологій, машинного навчання, аналізу даних, робототехніки та інших технологій значно покращують виробничі процеси та знижують нашу залежність від людської праці та процесу прийняття рішень. Використовуючи цифрові рішення, виробництво може зменшити кількість людських помилок та підвищити швидкість адаптації промислових процесів до нової інформації.",
            path: "/ua/комплексні-рішення/лінія-поверхневого-монтажу/лінія-smt-industry-40",
            lang: "Докладно..."
        }
    ]
    if (props.lang === "ru") {
        return (
            <SectionWrap>
                <Container>
                    <Row>
                    <Col lg={12}>
                           <h6 style={{textAlign: "justify"}}>Поверхностный монтаж (SMT) - это уже классическая технология сборки электронных блоков. Процесс SMT делится на три основных этапа – нанесение паяльной пасты, установка электронных компонентов и пайка в печи оплавления припоя. В зависимости от продукта и программы выпуска линии поверхностного монтажа могут быть полностью автоматическими или с отдельными единицами оборудования. При повышенных требованиях к качеству изделий и при больших программах выпуска линии оснащаются автоматическими оптическими системами для контроля нанесения паяльной пасты и монтажа электронных компонентов.</h6>
                        </Col>
                        <Col lg={12}>
                            <Timeline items={content} />
                        </Col>
                    </Row>
                </Container>
            </SectionWrap>
        )
    } else if (props.lang === "uk") {
        return (
            <SectionWrap>
                <Container>
                    <Row>
                    <Col lg={12}>
                           <h6 style={{textAlign: "justify"}}>Поверхневий монтаж (SMT) – це вже класична технологія складання електронних блоків. Процес SMT ділиться на три основні етапи – нанесення паяльної пасти, встановлення електронних компонентів та пайка у печі оплавлення припою. Залежно від продукту та програми випуску лінії поверхневого монтажу можуть бути повністю автоматичними або окремими одиницями обладнання. При підвищених вимогах до якості виробів і великих програмах випуску лінії оснащуються автоматичними оптичними системами контролю нанесення паяльної пасти і монтажу електронних компонентів.</h6>
                        </Col>
                        <Col lg={12}>
                            <Timeline items={contentua} />
                        </Col>
                    </Row>
                </Container>
            </SectionWrap>
        )
    }
}

export default TimelineArea
