[
    {
        "id": "appointment-hero-content",
        "bgImage": "./images/hero/home-appointment-hero-bg-image.jpg", 
        "subtitle": "Secure & IT Services",
        "title": "Excellent IT services for your success",
        "video": "https://www.youtube.com/watch?v=9No-FiEInLA",
        "buttonText": "How we work"
    },
    {
        "id": "appointment-services",
        "title": "Services We Deliver <br/> we provide <span>truly prominent IT solutions.</span>",
        "subtitle": "INDUSTRIES WE SERVE",
        "path": "/contact-us"
    }, 
    {
        "id": "appointment-about-us",
        "title": "We’ve been thriving in <span>38 years</span>",
        "subtitle": "DISCOVER OUR COMPANY",
        "tab_header": [
            {
                "id": "our-mission-tab",
                "title": "Our Mission"
            }, 
            {
                "id": "our-services-tab",
                "title": "Our services"
            }, 
            {
                "id": "teachonology-partners-tab",
                "title": "Technology Partners"
            },
            {
                "id": "our-awards-tab",
                "title": "Our Awards"
            }
        ],
        "about_content": {
            "text": "We’re available for 8 hours a day! <br/> Contact to require a detailed analysis and assessment of your plan.",
            "list": [
                "IT Consultancy",
                "IT Design",
                "Desktop Computing",
                "Software Engineering"
            ],
            "link": "/about-us",
            "video_link": "https://www.youtube.com/watch?v=9No-FiEInLA",
            "video_preview": "./images/about-us/video-01-image-01-570x350.jpg"
        }
    },
    {
        "id": "appointment-team-section",
        "title": "Our <span>experience<span> experts",
        "desc": "Mitech specializes in technological and IT-related services such as product engineering, warranty management, building cloud, infrastructure, network, etc.",
        "join_link": "/",
        "team_link": "/leadership"
    },
    {
        "id": "appointment-case-section",
        "title": "Комплексные решения для поверхностного монтажа<br><span>SMT линия - 3 года гарантии!</span>",
        "uatitle": "Комплексні рішення для поверхневого монтажу<br><span>SMT лінія - 3 роки гарантії</span>",
        "entitle": "Complete solutions for surface mounting<br><span>SMT line</span>",
        "subtitle": "High-End  оборудование для SMT",
        "uasubtitle": "High-End  обладнання для SMT",
        "ensubtitle": "High-End SMT machines",
        "bottom_text": "Challenges are just opportunities in disguise.",
        "bottom_link_text": "Take the challenge!",
        "bottom_link": "/case-studies",
        "bgImage": "./images/bg/case-study-section-bg.png"
    },
    {
        "id": "budget-stencil-cleaning",
        "title": "Бюджетные решения для чистки  SMT трафаретов<br><span>Гарантия качества нанесения пасты.</span>",
        "uatitle": "Бюджетні рішення для чищення SMT трафаретів<br><span>Гарантія якості нанесення пасти.</span>",
        "entitle": "Low cost solutions for cleaning SMT stencils<br><span>High quality of solder paste printing.</span>",
        "subtitle": "Решения для очистки",
        "uasubtitle": "Рішення для чищення",
        "ensubtitle": "Cleaning solutions",
        "rutext": "Уменьшение элементной базы усложняет не только процесс установки электронных компонентов на печатные платы. Усложняется процесс нанесения паяльной пасты. Очень важным становится соблюдение точной дозы паяльной пасты на платах. Если раньше мойка трафаретов выглядела непонятной и экзотической технологической операцией, то сейчас это необходимость. Не все предприятия мелкосерийного производства могут позволить автоматические машины для мойки трафаретов. В ультразвуковых ваннах большой расход моющих жидкостей. Портативна ультразвуковая очистка трафаретов – самое бюджетное и надежное решение.",
        "uatext": "Зменшення елементної бази ускладнює не тільки процес встановлення електронних компонентів на друковані плати. Ускладнюється процес нанесення паяльної пасти. Дуже важливим стає дотримання точної дози паяльної пасти на платах. Якщо раніше миття трафаретів виглядала незрозумілою і екзотичної технологічною операцією, то зараз це необхідність. Не всі підприємства дрібносерійного виробництва можуть дозволити автоматичні машини для чищення трафаретів. В ультразвукових ваннах велика витрата миючих рідин. Портативний пристрій ультразвукового чищення трафаретів - бюджетне і надійне рішення.",
        "entext": "Reducing electronics components complicates not only the process of mounting  electronics components on printed circuit boards. The process of solder paste printing becomes more complicated. It becomes very important to print fine dose of solder paste on the boards. If stencil cleaning now it is a necessity. Not all small companies can afford automatic stencil cleaners. Ultrasonic baths need a lot of cleaning liquid. Portable ultrasonic stencil cleaner is the most cost-effective and reliable solution.",
        "bottom_text": "Challenges are just opportunities in disguise.",
        "bottom_link_text": "Take the challenge!",
        "bottom_link": "/case-studies",
        "bgImage": "./images/bg/case-study-section-bg.png"
    },
    {
        "id": "small-smt",
        "title": "Бюджетные решения для мелкосерийного SMT <br><span>Минимальные инвестиции.</span>",
        "uatitle": "Бюджетні рішення для дрібносерійного SMT<br><span>Мінімальні інвестиції.</span>",
        "entitle": "Low cost solutions for SMT<br><span>Minimum investment.</span>",
        "subtitle": "Решения для поверхностного монтажа компонентов",
        "uasubtitle": "Рішення для поверхневого монтажу компонентів",
        "ensubtitle": "Solutions for Surface Mount Technology.",
        "rutext": "Линия SMD монтажа для мелкосерийного производства включает в себя три основные технологические процессы: нанесение паяльной пасты, установка электронных компонентов на печатную плату, оплавление паяльной пасты в печи. Нанесение паяльной пасты осуществляется на простом устройстве трафаретной печати с ручным перемещением ракелей. Для изделий с высокой плотностью монтажа рекомендуются полуавтоматические устройства для нанесения паяльной пасты. Установка электронных компонентов на плату  производится в автоматическом режиме на установщике SMD начального уровня. Оплавление припоя в конвейерной печи начального или среднего уровня. Все оборудование линии SMD монтажа имеет отдельностоящее исполнение и не завязывается в линию.",
        "uatext": "Лінія SMD монтажу для дрібносерійного виробництва включає в себе три основні технологічні процеси: нанесення паяльної пасти, встановлення електронних компонентів на друковану плату, оплавлення паяльної пасти в печі. Нанесення паяльної пасти здійснюється на простому пристрої трафаретного друку з ручним переміщенням ракелів. Для виробів з високою щільністю монтажу рекомендуються напівавтоматичні пристрої для нанесення паяльної пасти. Встановлення електронних компонентів на плату проводиться в автоматичному режимі на машині для встановлення SMD початкового рівня. Оплавлення припою в конвеєрної печі початкового або середнього рівня. Все обладнання лінії SMD монтажу має окремо-стояче виконання і не зав'язується в лінію.",
        "entext": "SMD assembly line for small-scale production includes three main technological processes: solder paste printing, mounting of electronic components on a printed circuit board, reflowing solder paste in an reflow oven. Solder paste printed on a simple stencil printer with manual movement of the squeegees. For products with a high mounting density, semi-automatic solder paste printing are recommended. Electronic components mounted automatically on an entry-level SMD placer. Reflow solder in an entry-level or mid-range conveyor reflow oven. All machines of the SMD assembly line has a stand-alone off line design.",
        "bottom_text": "Challenges are just opportunities in disguise.",
        "bottom_link_text": "Take the challenge!",
        "bottom_link": "/case-studies",
        "bgImage": "./images/bg/case-study-section-bg.png"
    },
    {
        "id": "appointment-contact-section",
        "title": "Need a hand?",
        "subtitle": "Reach out to the world’s most reliable IT services.",
        "bgImage": "./images/bg/contact-section-bg.png",
        "contact_info": {
            "title": "REACH OUT NOW!",
            "phone": "(+00) 123 567990",
            "text": "Start the collaboration with us while figuring out the best solution based on your needs."
        }
    }
]