[
    {
        "id": "tht-manual",
        "title": "Линия для монтажа компонентов в отверстия<br><span>Ручная установка компонентов</span>",
        "uatitle": "Лінія для монтажу компонентів в отвори<br><span>Ручне встановлення компонентів</span>",
        "entitle": "Complete solutions for surface mounting<br><span>SMT line</span>",
        "subtitle": "Автоматизация выводного монтажа",
        "uasubtitle": "Автоматизація монтажу в отвори",
        "ensubtitle": "High-End SMT machines",
        "excerpt": "Конвейерная линия для монтажа электронных компонентов в отверстия печатных плат. Места для ручной установки компонентов организуются на конвейере. Количество рабочих мест для ручной установки рассчитывается из программы выпуска и сменности работы. Конвейер может быть с автоматическим или ручным перемещением печатных плат. После установки электронных компонентов плата поступает на машину для пайки (машина селективной пайки или машина пайки волной припоя).",
        "uaexcerpt": "Конвеєрна лінія для монтажу електронних компонентів в отвори друкованих плат. Місця для ручного встановлення компонентів організовуються на конвеєрі. Кількість робочих місць для ручного встановлення розраховується із програми випуску та змінності роботи. Конвеєр може бути автоматичним або ручним переміщенням друкованих плат. Після встановлення електронних компонентів плата надходить на машину для паяння (машина селективного паяння або машина паяння хвилею припою).",
        "speedru": "Производительность линии, макс - Рассчитывается по изделию ",
        "speedua": "Продуктивність лінії, макс - Розраховується за виробом",
        "componentru": "Устанавливаемые компоненты - Монтируемые в отверстия",
        "componentua": "Компоненти, що встановлюються - ті що монтуються в отвори",
        "pcb_dimru": "Размер плат - Макс. 510 х 460 мм ",
        "pcb_dimua": "Розмір плат - Макс. 510 х 460 мм",
        "line_lengthru": "Длина линии прим. - Зависти от кол-ва мест для ручной установки",
        "line_lengthua": "Довжина лінії приб. - Залежно від кількості місць ручного встановлення",
        "bgImage": "./images/bg/case-study-section-bg.png"
    },
    {
        "id": "tht-auto",
        "title": "Линия для монтажа компонентов в отверстия<br><span>Автоматическая установка компонентов</span>",
        "uatitle": "Лінія для монтажу компонентів в отвори<br><span>Автоматичне встановлення компонентів</span>",
        "entitle": "Complete solutions for surface mounting<br><span>SMT line</span>",
        "subtitle": "Автоматизация выводного монтажа",
        "uasubtitle": "Автоматизація монтажу в отвори",
        "ensubtitle": "High-End SMT machines",
        "excerpt": "Конвейерная автоматическая линия для монтажа электронных компонентов в отверстия печатных плат. Установка электронных компонентов производится на специальных многозадачных машинах, которые встроены в производственную линию. В составе линии могут организовываться места для ручной установки компонентов и инспекции монтажа. После установки электронных компонентов плата поступает на машину для пайки (машина селективной пайки или машина пайки волной припоя).",
        "uaexcerpt": "Конвеєрна автоматична лінія для монтажу електронних компонентів в отвори друкованих плат. Встановлення електронних компонентів здійснюється на спеціальних багатозадачних машинах, які вбудовуються у стандартну виробничу лінію. У складі лінії можуть організовуватись місця для ручного встановлення компонентів та інспекції монтажу. Після встановлення електронних компонентів плата надходить на машину для паяння (машина селективного паяння або машина паяння хвилею припою).",
        "speedru": "Производительность линии, макс - Скорость установки в отверстия 0,8 сек/комп",
        "speedua": "Продуктивність лінії, макс - Швидкість установки в отвори 0,8 сек/комп.",
        "componentru": "Устанавливаемые компоненты - до 50х50х30 мм",
        "componentua": "Компоненти, що встановлюються - до 50х50х30 мм",
        "pcb_dimru": "Размер плат - 510 х 360 мм",
        "pcb_dimua": "Розмір плат - 510 х 360 мм",
        "line_lengthru": "Длина линии прим. - от 6 м",
        "line_lengthua": "Довжина лінії приб. -  від 6 м",
        "bgImage": "./images/bg/case-study-section-bg.png"
    },
    {
        "id": "inspection-island",
        "title": "Отдельная линия оптической инспекции <br><span>Оптимизация процессов контроля качества</span>",
        "uatitle": "Окрема лінія оптичної інспекції <br><span>Оптимізація процесів контролю якості</span>",
        "entitle": "Complete solutions for surface mounting<br><span>SMT line</span>",
        "subtitle": "Линии AOI",
        "uasubtitle": "Лінії AOI",
        "ensubtitle": "High-End SMT machines",
        "excerpt": "Оборудование для автоматической оптической инспекции (AOI) может работать не только в составе линии для поверхностного монтажа (SMT). Такое решение может быть полезным для небольших компаний с многономенклатурным производством, где  установлено несколько линий на базе одного установщика. Для таких линии устанавливать машину AOI для каждой линии будет дорогим решением. Оптимизировать процесс инспекции можно, если установить отдельную линии оптической инспекции с автоматической загрузкой и выгрузкой плат.",
        "uaexcerpt": "Обладнання для автоматичної оптичної інспекції (AOI) може працювати не лише у складі лінії для поверхневого монтажу (SMT). Таке рішення може бути корисним для невеликих компаній із багатономенклатурним виробництвом, де встановлено кілька ліній на базі одного установника. Для таких ліній встановлювати AOI для кожної лінії буде дорогим рішенням. Оптимізувати процес інспекції можна, якщо встановити окрему лінію оптичної інспекції з автоматичним завантаженням та вивантаженням плат.",
        "speedru": "Производительность линии, макс - 48 × 36 мм за 0,51 с",
        "speedua": "Продуктивність лінії, макс - 48 × 36 мм за 0,51 с",
        "componentru": "Предмет инспекции – компоненты, форма паянного соединения, дефекты пайки, обозначения",
        "componentua": "Предмет інспекції – компоненти, форма паяного з'єднання, дефекти паяння, позначення",
        "pcb_dimru": "Размер плат - 50х50 - 630х300 мм ",
        "pcb_dimua": "Розмір плат - 50х50 - 630х300 мм",
        "line_lengthru": "Длина линии прим. - 5м",
        "line_lengthua": "Довжина лінії приб. - 5м",
        "bgImage": "./images/bg/case-study-section-bg.png"
    },
    {
        "id": "coating-uv",
        "title": "Линия селективного нанесения покрытий с УФ отверждением<br><span>Автоматизация процессов влагозащиты</span>",
        "uatitle": "Лінія селективного нанесення покриттів з УФ затвердінням<br><span>Автоматизація процесів вологозахисту</span>",
        "entitle": "Complete solutions for surface mounting<br><span>SMT line</span>",
        "subtitle": "Защита электроники",
        "uasubtitle": "Захист електроніки",
        "ensubtitle": "High-End SMT machines",
        "excerpt": "Линия покрытия печатных плат с ультрафиолетовым отверждением позволяет автоматизировать процессы нанесения влагозащитных покрытий на платы и существенно увеличить производительность и эффективность производства. Применяется для специальных материалов, которые отвердевают при помощи ультрафиолетового излучения. Платы загружаются с устройства автоматической загрузки в машину для селективного нанесения покрытий, которая по программе наносит лак в определенные места, на отдельные компоненты или под компоненты. Далее плата поступает на печь ИК полимеризации и и за считаные минуты плата выходит с линии с затвердевшим покрытием.",
        "uaexcerpt": "Лінія покриття друкованих плат з ультрафіолетовим затвердінням дозволяє автоматизувати процеси нанесення вологозахисних покриттів на плати та суттєво збільшити продуктивність та ефективність виробництва. Застосовується для спеціальних матеріалів, які твердіють за допомогою ультрафіолетового випромінювання. Плати завантажуються з пристрою автоматичного завантаження в машину для селективного нанесення покриттів, яка за програмою наносить лак у певні місця, окремі компоненти або під компоненти. Далі плата надходить на піч ІЧ полімеризації і за лічені хвилини плата виходить з лінії з затверділим покриттям.",
        "speedru": "Производительность линии, макс - Зависти от платы и материала покрытия",
        "speedua": "Продуктивність лінії, макс - Залежить від плати та матеріалу покриття",
        "componentru": "Нанесение материала – отдельные места, отдельные компоненты, под компоненты, сбоку и сверху компонентов.",
        "componentua": "Нанесення матеріалу – окремі місця, окремі компоненти, під компоненти, збоку та зверху компонентів.",
        "pcb_dimru": "Рабочее поле – зависит от типа и количества дозирующих головок",
        "pcb_dimua": "Робоче поле – залежить від типу та кількості дозуючих головок",
        "line_lengthru": "Длина линии прим. - 4м",
        "line_lengthua": "Довжина лінії приб. - 4м",
        "bgImage": "./images/bg/case-study-section-bg.png"
    },
    {
        "id": "coating-ir",
        "title": "Линия селективного нанесения покрытий с ИК отверждением<br><span>Автоматизация процессов влагозащиты</span>",
        "uatitle": "Лінія селективного нанесення покриттів з ІЧ затвердінням<br><span>Автоматизація процесів вологозахисту</span>",
        "entitle": "Complete solutions for surface mounting<br><span>SMT line</span>",
        "subtitle": "Защита электроники",
        "uasubtitle": "Захист електроніки",
        "ensubtitle": "High-End SMT machines",
        "excerpt": "Линия покрытия печатных плат с инфракрасным отверждением позволяет автоматизировать процессы нанесения влагозащитных покрытий на платы и ускорить время отверждения материала. Применяется для покрытий, которые отвердевают при определенных температурах или влажности (акриловые, силиконовые, уретановые). Платы загружаются с устройства автоматической загрузки в машину для селективного нанесения покрытий, которая по программе наносит лак в определенные места или на отдельные компоненты. Далее плата поступает на печь ИК полимеризации. В зависимости от материала, конфигурация печи позволяет контролировать влажность внутри для материалов, которые отверждаются влагой.",
        "uaexcerpt": "Лінія покриття друкованих плат з інфрачервоним затвердінням дозволяє автоматизувати процеси нанесення вологозахисних покриттів на плати та прискорити час затвердіння матеріалу. Застосовується для покриттів, які твердіють за певних температур або вологості (акрилові, силіконові, уретанові). Плати завантажуються з пристрою автоматичного завантаження в машину для селективного нанесення покриттів, яка за програмою наносить лак у певні місця або на окремі компоненти. Далі плата надходить на піч ІЧ полімеризації. Залежно від матеріалу, конфігурація печі дозволяє контролювати вологість усередині для матеріалів, що затверджуються вологою.",
        "speedru": "Производительность линии, макс - Зависти от платы и материала покрытия",
        "speedua": "Продуктивність лінії, макс - Залежить від плати та матеріалу покриття",
        "componentru": "Нанесение материала – отдельные места, отдельные компоненты, под компоненты, сбоку и сверху компонентов.",
        "componentua": "Нанесення матеріалу – окремі місця, окремі компоненти, під компоненти, збоку та зверху компонентів.",
        "pcb_dimru": "Рабочее поле – зависит от типа и количества дозирующих головок",
        "pcb_dimua": "Робоче поле – залежить від типу та кількості дозуючих головок",
        "line_lengthru": "Длина линии прим. - 4м (Зависит от длинны печи)",
        "line_lengthua": "Довжина лінії приб. - 4м (Залежить від довжини печі)",
        "bgImage": "./images/bg/case-study-section-bg.png"
    },
    {
        "id": "coating-twoside",
        "title": "Линия селективного нанесения покрытий на 2-е стороны платы с УФ отверждением<br><span>Автоматизация процессов влагозащиты</span>",
        "uatitle": "Лінія селективного нанесення покриттів на 2-і сторони плати з УФ затвердінням<br><span>Автоматизація процесів вологозахисту</span>",
        "entitle": "Complete solutions for surface mounting<br><span>SMT line</span>",
        "subtitle": "Защита электроники",
        "uasubtitle": "Захист електроніки",
        "ensubtitle": "High-End SMT machines",
        "excerpt": "Линия для нанесения защитных покрытий на две стороны электронной платы. Применяется для специальных материалов, которые отвердевают при помощи ультрафиолетового излучения. Платы загружаются с устройства автоматической загрузки в машину для селективного нанесения покрытий, которая по программе наносит лак в определенные места, на отдельные компоненты или под компоненты. Далее плата переворачивается на специальном конвейере и поступает на вторую машину для селективного нанесения материалов. После нанесения лака плата заходит в печь для полимеризации защитного  покрытия. Для автоматизации инспекции качества нанесения покрытия рекомендуется использовать опцию автоматической инспекции на машинах селективного нанесения",
        "uaexcerpt": "Лінія для нанесення захисного покриття на дві сторони електронної плати. Застосовується для спеціальних матеріалів, які твердіють за допомогою ультрафіолетового випромінювання. Плати завантажуються з пристрою автоматичного завантаження в машину для селективного нанесення покриттів, яка за програмою наносить лак у певні місця, окремі компоненти або під компоненти. Далі плата перевертається на спеціальному конвеєрі та надходить на другу машину для селективного нанесення матеріалів. Після нанесення лаку плата заходить у піч для полімеризації захисного покриття. Для автоматизації інспекції якості нанесення покриття рекомендується використовувати опцію автоматичної інспекції на машинах селективного нанесення",
        "speedru": "Производительность линии, макс - Зависти от платы и материала покрытия",
        "speedua": "Продуктивність лінії, макс - Залежить від плати та матеріалу покриття",
        "componentru": "Нанесение материала – отдельные места, отдельные компоненты, под компоненты, сбоку и сверху компонентов.",
        "componentua": "Нанесення матеріалу – окремі місця, окремі компоненти, під компоненти, збоку та зверху компонентів.",
        "pcb_dimru": "Рабочее поле – зависит от типа и количества дозирующих головок",
        "pcb_dimua": "Робоче поле – залежить від типу та кількості дозуючих головок",
        "line_lengthru": "Длина линии прим. - 6м",
        "line_lengthua": "Довжина лінії приб. - 6м",
        "bgImage": "./images/bg/case-study-section-bg.png"
    },
    {
        "id": "coating-dip",
        "title": "Линия нанесения защитных покрытий погружением<br><span>Автоматизация процессов влагозащиты</span>",
        "uatitle": "Лінія нанесення захисних покриттів зануренням<br><span>Автоматизація процесів вологозахисту</span>",
        "entitle": "Complete solutions for surface mounting<br><span>SMT line</span>",
        "subtitle": "Защита электроники",
        "uasubtitle": "Захист електроніки",
        "ensubtitle": "High-End SMT machines",
        "excerpt": "Крупносерийное и массовое производство электронных изделий требует особых подходов и оптимизации производственных процессов. Не исключением являются технологические процессы нанесения покрытий на собранные электронные узлы, которые требуют полной защиты от влияния окружающей среды. Для таких требований разработаны специальные линии для нанесения защитных покрытий методом погружение. Такие линии представляют собой замкнутую систему. Нанесение материала и его полимеризация происходят последовательно в одном конструктиве. В зависимости от используемых материалов в системе создаются специальные условия окружающей среды.",
        "uaexcerpt": "Багатосерійне та масове виробництво електронних виробів потребує особливих підходів та оптимізації виробничих процесів. Не є винятком ​​технологічні процеси нанесення покриттів на складені електронні вузли, які вимагають повного захисту від впливу навколишнього середовища. Для таких вимог розроблені спеціальні лінії для нанесення захисних покриттів методом занурення. Такі лінії є замкненою системою. Нанесення матеріалу та його полімеризація відбуваються послідовно в одному конструктиві. Залежно від матеріалів у системі створюються спеціальні умови.",
        "speedru": "Производительность линии, макс - зависти от платы и материала покрытия",
        "speedua": "Продуктивність лінії, макс - залежить від плати та матеріалу покриття",
        "componentru": "Нанесение материала – полное или частичное покрытие платы",
        "componentua": "Нанесення матеріалу – повне або часткове покриття плати.",
        "pcb_dimru": "Размер плат – конфигурация под размер плат",
        "pcb_dimua": "Розмір плат – конфігурація під розмір плат",
        "line_lengthru": "Длина линии прим. - 6м",
        "line_lengthua": "Довжина лінії приб. - 6м",
        "bgImage": "./images/bg/case-study-section-bg.png"
    },
    {
        "id": "smt-prototyping-1",
        "title": "Оборудование для прототипирования<br><span>Ручная установка компонентов<span>",
        "uatitle": "Устаткування для прототипування<br><span>Ручне встановлення компонентів<span>",
        "entitle": "Complete solutions for surface mounting<br><span>SMT line</span>",
        "subtitle": "SMT для производства прототипов",
        "uasubtitle": "SMT для производства прототипов",
        "ensubtitle": "High-End SMT machines",
        "excerpt": "Самый простой вариант для оптимизации монтажа электронных компонентов на поверхность печатных плат в условиях прототипировання электронных узлов. Паяльная паста наносится с помощью ручного дозатора для нанесения материалов. Установка электронных компонентов производится вакуумным пинцетом. Оплавление паяльной пасты происходит в паяльной печи камерного типа со смешанным типом нагревания (ИК + принудительная конвекция)",
        "uaexcerpt": "Найпростіший варіант для оптимізації монтажу електронних компонентів на поверхню друкованих плат за умов прототипування електронних вузлів. Паяльна паста наноситься за допомогою ручного дозатора для нанесення матеріалів. Установка електронних компонентів провадиться вакуумним пінцетом. Оплавлення паяльної пасти відбувається в паяльній печі камерного типу зі змішаним типом нагрівання (ІЧ + примусова конвекція)",
        "speedru": "Производительность линии, макс - Зависит от оператора",
        "speedua": "Продуктивність лінії, макс - Залежить від оператора",
        "componentru": "Устанавливаемые компоненты - SMD",
        "componentua": "Компоненти, що встановлюються - SMD",
        "pcb_dimru": "Размер плат - 300х370мм",
        "pcb_dimua": "Розмір плат - 300х370мм",
        "line_lengthru": "Длина линии прим. - настольное исполнение ",
        "line_lengthua": "Довжина лінії приб. - настільне виконання",
        "bgImage": "./images/bg/case-study-section-bg.png"
    },
    {
        "id": "smt-prototyping-2",
        "title": "Оборудование для прототипирования<br><span>Установка компонентов манипулятором<span>",
        "uatitle": "Устаткування для прототипування<br><span>Встановлення компонентів маніпулятором<span>",
        "entitle": "Complete solutions for surface mounting<br><span>SMT line</span>",
        "subtitle": "SMT для производства прототипов",
        "uasubtitle": "SMT для производства прототипов",
        "ensubtitle": "High-End SMT machines",
        "excerpt": "Вариант установки электронных компонентов при помощи манипулятора. Оборудование обеспечивает более комфортные условия для работы оператора, что уменьшает возможное число ошибок при монтаже. Оборудование позволяет собирать более сложные платы. Паяльная паста наносится на том же устройстве с применением строенного дозатора для нанесения материалов. Оплавление паяльной пасты происходит в паяльной печи камерного типа со смешанным типом нагревания (ИК + принудительная конвекция).",
        "uaexcerpt": "Варіант встановлення електронних компонентів за допомогою маніпулятора. Устаткування забезпечує комфортніші умови для роботи оператора, що зменшує можливу кількість помилок при монтажі. Обладнання дозволяє збирати складніші плати. Паяльна паста наноситься на тому самому пристрої із застосуванням вбудованого дозатора для нанесення матеріалів. Оплавлення паяльної пасти відбувається в паяльній печі камерного типу зі змішаним типом нагрівання (ІЧ+примусова конвекція).",
        "speedru": "Производительность линии, макс - 700 комп/час, зависит от оператора",
        "speedua": "Продуктивність лінії, макс - 700 комп/час, залежить від оператора",
        "componentru": "Устанавливаемые компоненты -  0201 до QFP с шагом 0.65 мм",
        "componentua": "Компоненти, що встановлюються - 0201 до QFP с шагом 0.65 мм",
        "pcb_dimru": "Размер плат - 300х370мм",
        "pcb_dimua": "Розмір плат - 300х370мм",
        "line_lengthru": "Длина линии прим. - настольное исполнение ",
        "line_lengthua": "Довжина лінії приб. - настільне виконання",
        "bgImage": "./images/bg/case-study-section-bg.png"
    },
    {
        "id": "smt-prototyping-3",
        "title": "Оборудование для прототипирования<br><span>Автоматическая установка компонентов<span>",
        "uatitle": "Обладнання для прототипування<br><span>Автоматичне встановлення компонентів<span>",
        "entitle": "Complete solutions for surface mounting<br><span>SMT line</span>",
        "subtitle": "SMT для производства прототипов",
        "uasubtitle": "SMT для производства прототипов",
        "ensubtitle": "High-End SMT machines",
        "excerpt": "Прототипирование сложных электронных плат с плотным монтажом, где много мелких электронных компонентов и ИС с малым шагов выводов можете требовать других подходов. Ручной монтаж может быть не эффективным и приводит к множественным дефектам, которые могут проявится потом и влиять на тестирование прототипа. Организация таких процессов требует прецизионного гибкого оборудования с невысокой производительностью, но с большими возможностями. Прототипирование изделий, которые планируются производится крупными сериями, требует прототипов, которые изготовлены  в реальных производственных условиях.",
        "uaexcerpt": "Прототипування складних електронних плат із щільним монтажем, де багато дрібних електронних компонентів та ІС з малим кроком виводів можете вимагати інших підходів. Ручний монтаж може бути не ефективним і призводить до множинних дефектів, які можуть проявитися потім і впливати на тестування прототипу. Організація таких процесів потребує прецизійного гнучкого обладнання з невисокою продуктивністю, але з більшими можливостями. Прототипування виробів, що плануються, виробляється великими серіями, вимагає прототипів, які виготовлені в реальних виробничих умовах.",
        "speedru": "Производительность линии, макс - до 4000 комп/час",
        "speedua": "Продуктивність лінії, макс - до 4000 комп/час",
        "componentru": "Устанавливаемые компоненты -  от 0201 до 70х70мм, шаг ИС до 0,4мм",
        "componentua": "Компоненти, що встановлюються - від 0201 до 70х70мм, крок ІС до 0,4мм",
        "pcb_dimru": "Размер плат - 520х360мм",
        "pcb_dimua": "Розмір плат - 520х360мм",
        "line_lengthru": "Длина линии прим. - 5м",
        "line_lengthua": "Довжина лінії приб. - 5м",
        "bgImage": "./images/bg/case-study-section-bg.png"
    },
    {
        "id": "smt-small-1",
        "title": "Оборудование для мелкосерийного производства<br><span>Линия SMD монтажа<span>",
        "uatitle": "Обладнання для дрібносерійного виробництва<br><span>Лінія SMD монтажу<span>",
        "entitle": "Complete solutions for surface mounting<br><span>SMT line</span>",
        "subtitle": "SMT для мелкосерийного производства",
        "uasubtitle": "SMT для дрібносерійного виробництва",
        "ensubtitle": "High-End SMT machines",
        "excerpt": "Мелкосерийное производство электроники уже требует стабильности повторяемости результата в отличии от протоипирования изделий. Нанесение паяльной пасты через трафарет увеличивает не только производительность, но и улучшает повторяемость за счет стабильности геометрических размеров металлического трафарета. Применение автоматического оборудования для установки  SMD существенно снижает человеческий фактор в процессах монтажа компонентов. При старте мелкосерийного производства разумно начать с механизации ручной установки при помощи манипулятора. Это требует минимальных инвестиций и позволяет ознакомится с технологией поверхностного монтажа (SMT) с минимальными затратами.",
        "uaexcerpt": "Дрібносерійне виробництво електроніки вже потребує стабільності повторюваності результату на відміну від прототипування виробів. Нанесення паяльної пасти через трафарет збільшує як продуктивність, так і поліпшує повторюваність за допомогою стабільності геометричних розмірів металевого трафарета. Застосування автоматичного устаткування встановлення SMD істотно знижує людський чинник у процесах монтажу компонентів. При старті дрібносерійного виробництва можна почати з механізації ручного встановлення компоненті за допомогою маніпулятора. Це вимагає мінімальних інвестицій та дозволяє ознайомитися з технологією поверхневого монтажу (SMT) з мінімальними витратами.",
        "speedru": "Производительность линии, макс - 700 комп/час, зависит от оператора",
        "speedua": "Продуктивність лінії, макс - 700 комп/час, залежить від оператора",
        "componentru": "Устанавливаемые компоненты -  0201 до QFP с шагом 0.65 мм",
        "componentua": "Компоненти, що встановлюються - 0201 до QFP с кроком 0.65 мм",
        "pcb_dimru": "Размер плат - 220х320мм",
        "pcb_dimua": "Розмір плат - 220х320мм",
        "feeder": "Количество мест под питатели 8мм - 46",
        "feederua": "Кількість місць під живильники 8мм - 46",
        "line_lengthru": "Длина линии прим. - настольное исполнение ",
        "line_lengthua": "Довжина лінії приб. - настільне виконання",
        "bgImage": "./images/bg/case-study-section-bg.png"
    },
    {
        "id": "smt-small-2",
        "title": "Оборудование для мелкосерийного производства<br><span>Линия SMD монтажа<span>",
        "uatitle": "Обладнання для дрібносерійного виробництва<br><span>Лінія SMD монтажу<span>",
        "entitle": "Complete solutions for surface mounting<br><span>SMT line</span>",
        "subtitle": "SMT для мелкосерийного производства",
        "uasubtitle": "SMT для дрібносерійного виробництва",
        "ensubtitle": "High-End SMT machines",
        "excerpt": "Применение автоматического оборудования для установки SMD существенно снижает человеческий фактор в процессах монтажа компонентов. Автоматические установщики электронных компонентов распознают реальную печатную плату по реперным знакам и вносят поправки при размещении компонентов на платы. Система технического зрения распознает фактические размеры компонентов и сравнивает их теоретические значение которые хранятся в памяти машины. Автоматические питатели распаковывают компоненты, что находятся в ленте и подают их в рабочую зону машины.",
        "uaexcerpt": "Застосування автоматичного обладнання для встановлення  SMD істотно знижує людський чинник у процесах монтажу компонентів на плату. Автоматичні установники електронних компонентів розпізнають реальну друковану плату по реперним знакам та вносять поправки під час розміщення компонентів на плати. Система технічного зору розпізнає фактичні розміри компонентів та порівнює їх теоретичні значення, які зберігаються в пам'яті машини. Автоматичні живильники розпаковують компоненти, що знаходяться у стрічці та подають їх у робочу зону машини.",
        "speedru": "Производительность линии, макс - 700 комп/час, зависит от оператора",
        "speedua": "Продуктивність лінії, макс - 700 комп/час, залежить від оператора",
        "componentru": "Устанавливаемые компоненты -  от 0402 до 50х50мм, высота до 10мм",
        "componentua": "Компоненти, що встановлюються - від 0402 до 50х50мм, висота до 10мм",
        "pcb_dimru": "Размер плат - 260х260мм",
        "pcb_dimua": "Розмір плат - 260х260мм",
        "feeder": "Количество мест под питатели 8мм - 46",
        "feederua": "Кількість місць під живильники 8мм - 46",
        "line_lengthru": "Длина линии прим. - настольное исполнение ",
        "line_lengthua": "Довжина лінії приб. - настільне виконання",
        "bgImage": "./images/bg/case-study-section-bg.png"
    },
    {
        "id": "smt-small-3",
        "title": "Оборудование для мелкосерийного производства<br><span>Линия SMD монтажа<span>",
        "uatitle": "Обладнання для дрібносерійного виробництва<br><span>Лінія SMD монтажу<span>",
        "entitle": "Complete solutions for surface mounting<br><span>SMT line</span>",
        "subtitle": "SMT для мелкосерийного производства",
        "uasubtitle": "SMT для дрібносерійного виробництва",
        "ensubtitle": "High-End SMT machines",
        "excerpt": "Организация линии поверхностного монтажа (SMT) состоит в том что бы максимально автоматизировать процесс монтажа компонентов на поверхность печатных плат. Единицы оборудования соединяются в линии при помощи специального конвейерного оборудования для работы с печатными платами. В условиях мелкосерийного производства можно существенно увеличить эффективность производства если завязать в линию автоматический установщик электронных компонентов и конвейерную паяльную печь с помощью соединительного конвейера. На конвейере, между установщиком и печью,  можно организовать рабочее место для визуальной инспекции установки компонентов.",
        "uaexcerpt": "Організація лінії поверхневого монтажу (SMT) полягає в тому, щоб максимально автоматизувати процес монтажу компонентів на поверхню друкованих плат. Одиниці обладнання з'єднуються в лінії за допомогою спеціального обладнання для роботи з друкованими платами. В умовах дрібносерійного виробництва можна істотно збільшити ефективність виробництва, якщо зав'язати в лінію автоматичний установник електронних компонентів та паяльну конвеєрну піч за допомогою сполучного конвеєра. На конвеєрі між установником і піччю можна організувати робоче місце для візуальної інспекції встановлення компонентів.",
        "speedru": "Производительность линии, макс - 12 000 комп/час",
        "speedua": "Продуктивність лінії, макс - 12 000 комп/час",
        "componentru": "Устанавливаемые компоненты -  от 0402 до 50х50мм, высота до 10мм",
        "componentua": "Компоненти, що встановлюються - від 0402 до 50х50мм, висота до 10мм",
        "pcb_dimru": "Размер плат - 500х200мм",
        "pcb_dimua": "Розмір плат - 500х200мм",
        "feeder": "Количество мест под питатели 8мм - 60",
        "feederua": "Кількість місць під живильники 8мм - 60",
        "line_lengthru": "Длина линии прим. - 6м",
        "line_lengthua": "Довжина лінії приб. - 6м",
        "bgImage": "./images/bg/case-study-section-bg.png"
    },
    {
        "id": "smt-small-4",
        "title": "Оборудование для мелкосерийного производства<br><span>Линия SMD монтажа<span>",
        "uatitle": "Обладнання для дрібносерійного виробництва<br><span>Лінія SMD монтажу<span>",
        "entitle": "Complete solutions for surface mounting<br><span>SMT line</span>",
        "subtitle": "SMT для мелкосерийного производства",
        "uasubtitle": "SMT для дрібносерійного виробництва",
        "ensubtitle": "High-End SMT machines",
        "excerpt": "Организация линии поверхностного монтажа (SMT) состоит в том что бы максимально автоматизировать процесс монтажа компонентов на поверхность печатных плат. Единицы оборудования соединяются в линии при помощи специального конвейерного оборудования для работы с печатными платами. В условиях мелкосерийного производства можно существенно увеличить эффективность производства если завязать в линию автоматический установщик электронных компонентов и конвейерную паяльную печь с помощью соединительного конвейера. На конвейере, между установщиком и печью,  можно организовать рабочее место для визуальной инспекции установки компонентов.",
        "uaexcerpt": "Організація лінії поверхневого монтажу (SMT) полягає в тому, щоб максимально автоматизувати процес монтажу компонентів на поверхню друкованих плат. Одиниці обладнання з'єднуються в лінії за допомогою спеціального обладнання для роботи з друкованими платами. В умовах дрібносерійного виробництва можна істотно збільшити ефективність виробництва, якщо зав'язати в лінію автоматичний установник електронних компонентів та паяльну конвеєрну піч за допомогою сполучного конвеєра. На конвеєрі між установником і піччю можна організувати робоче місце для візуальної інспекції встановлення компонентів.",
        "speedru": "Производительность линии, макс - 12 000 комп/час",
        "speedua": "Продуктивність лінії, макс - 12 000 комп/час",
        "componentru": "Устанавливаемые компоненты -  от 0402 до 50х50мм, высота до 10мм",
        "componentua": "Компоненти, що встановлюються - від 0402 до 50х50мм, висота до 10мм",
        "pcb_dimru": "Размер плат - 500х200мм",
        "pcb_dimua": "Розмір плат - 500х200мм",
        "feeder": "Количество мест под питатели 8мм - 70",
        "feederua": "Кількість місць під живильники 8мм - 70",
        "line_lengthru": "Длина линии прим. - 6м",
        "line_lengthua": "Довжина лінії приб. - 6м",
        "bgImage": "./images/bg/case-study-section-bg.png"
    },
    {
        "id": "smt-serial-1",
        "title": "Комплексные решения для монтажа d jndthcnbz <br><span>SMT линия - 3 года гарантии!</span>",
        "uatitle": "Комплексні рішення для поверхневого монтажу<br><span>SMT лінія - 3 роки гарантії</span>",
        "entitle": "Complete solutions for surface mounting<br><span>SMT line</span>",
        "subtitle": "High-End  оборудование для SMT",
        "uasubtitle": "High-End  обладнання для SMT",
        "ensubtitle": "High-End SMT machines",
        "excerpt": " fdfsdfsdfsdfsdf fsdfsdfsdfsd",
        "uaexcerpt": " fdfsdfsdfsdfsdf fsdfsdfsdfsd",
        "speedru": "Производительность линии, макс - ",
        "speedua": "Продуктивність лінії, макс - ",
        "componentru": "Устанавливаемые компоненты -",
        "componentua": "Компоненти, що встановлюються - ",
        "pcb_dimru": "Размер плат - мм ",
        "pcb_dimua": "Розмір плат - мм",
        "line_lengthru": "Длина линии прим. - ",
        "line_lengthua": "Довжина лінії приб. - ",
        "bgImage": "./images/bg/case-study-section-bg.png"
    },
    {
        "id": "smt-serial-2",
        "title": "Комплексные решения для монтажа d jndthcnbz <br><span>SMT линия - 3 года гарантии!</span>",
        "uatitle": "Комплексні рішення для поверхневого монтажу<br><span>SMT лінія - 3 роки гарантії</span>",
        "entitle": "Complete solutions for surface mounting<br><span>SMT line</span>",
        "subtitle": "High-End  оборудование для SMT",
        "uasubtitle": "High-End  обладнання для SMT",
        "ensubtitle": "High-End SMT machines",
        "excerpt": " fdfsdfsdfsdfsdf fsdfsdfsdfsd",
        "uaexcerpt": " fdfsdfsdfsdfsdf fsdfsdfsdfsd",
        "speedru": "Производительность линии, макс - ",
        "speedua": "Продуктивність лінії, макс - ",
        "componentru": "Устанавливаемые компоненты -",
        "componentua": "Компоненти, що встановлюються - ",
        "pcb_dimru": "Размер плат - мм ",
        "pcb_dimua": "Розмір плат - мм",
        "line_lengthru": "Длина линии прим. - ",
        "line_lengthua": "Довжина лінії приб. - ",
        "bgImage": "./images/bg/case-study-section-bg.png"
    },
    {
        "id": "smt-serial-3",
        "title": "Комплексные решения для монтажа d jndthcnbz <br><span>SMT линия - 3 года гарантии!</span>",
        "uatitle": "Комплексні рішення для поверхневого монтажу<br><span>SMT лінія - 3 роки гарантії</span>",
        "entitle": "Complete solutions for surface mounting<br><span>SMT line</span>",
        "subtitle": "High-End  оборудование для SMT",
        "uasubtitle": "High-End  обладнання для SMT",
        "ensubtitle": "High-End SMT machines",
        "excerpt": " fdfsdfsdfsdfsdf fsdfsdfsdfsd",
        "uaexcerpt": " fdfsdfsdfsdfsdf fsdfsdfsdfsd",
        "speedru": "Производительность линии, макс - ",
        "speedua": "Продуктивність лінії, макс - ",
        "componentru": "Устанавливаемые компоненты -",
        "componentua": "Компоненти, що встановлюються - ",
        "pcb_dimru": "Размер плат - мм ",
        "pcb_dimua": "Розмір плат - мм",
        "line_lengthru": "Длина линии прим. - ",
        "line_lengthua": "Довжина лінії приб. - ",
        "bgImage": "./images/bg/case-study-section-bg.png"
    },
    {
        "id": "smt-serial-led",
        "title": "Комплексные решения для монтажа d jndthcnbz <br><span>SMT линия - 3 года гарантии!</span>",
        "uatitle": "Комплексні рішення для поверхневого монтажу<br><span>SMT лінія - 3 роки гарантії</span>",
        "entitle": "Complete solutions for surface mounting<br><span>SMT line</span>",
        "subtitle": "High-End  оборудование для SMT",
        "uasubtitle": "High-End  обладнання для SMT",
        "ensubtitle": "High-End SMT machines",
        "excerpt": " fdfsdfsdfsdfsdf fsdfsdfsdfsd",
        "uaexcerpt": " fdfsdfsdfsdfsdf fsdfsdfsdfsd",
        "speedru": "Производительность линии, макс - ",
        "speedua": "Продуктивність лінії, макс - ",
        "componentru": "Устанавливаемые компоненты -",
        "componentua": "Компоненти, що встановлюються - ",
        "pcb_dimru": "Размер плат - мм ",
        "pcb_dimua": "Розмір плат - мм",
        "line_lengthru": "Длина линии прим. - ",
        "line_lengthua": "Довжина лінії приб. - ",
        "bgImage": "./images/bg/case-study-section-bg.png"
    }
]