[
    {
        "id": "about-page-header-data",
        "title": "About Mitech",
        "desc": "Mitech specializes in technological and IT-related services such as product engineering, warranty management, building cloud, infrastructure, network, etc.",
        "bg_image": "../images/banner/banner-09.jpg"
    },
    {
        "id": "about-printers-data",
        "title": "Принтеры паяльной пасты",
        "uatitle": "Принтери паяльної пасти",
        "desc": "Оборудование для нанесения паяльной пасте через трафарет на контактные площадки печатных плат. От прототипирования – до крупносерийного производства.",
        "uadesc": "Обладнання для нанесення паяльної пасти через трафарет на контактні площадки друкованих плат. Від прототипування - до багато серійного виробництва.",
        "bg_image": "../images/bg/machines/machine-printer-m.png"
    },
    {
        "id": "about-placer-data",
        "title": "Автоматы установки компонентов",
        "uatitle": "Автомати встановлення компонентів",
        "desc": "Оборудование для установки электронных компонентов на поверхность и в отверстия печатных плат. От прототипирования – до крупносерийного производства.",
        "uadesc": "Обладнання для встановлення електронних компонентів на поверхню та в отвори друкованих плат. Від прототипування - до багато серійного виробництва.",
        "bg_image": "../images/bg/machines/machine-smt-m.png"
    },
    {
        "id": "about-reflow-data",
        "title": "Печи паяльные",
        "uatitle": "Печі паяльні",
        "desc": "Печи паяльные для оплавления паяльной пасты. Применяются для поверхностно монтажа – SMT. От прототипирования – до крупносерийного производства.",
        "uadesc": "Печі паяльні для оплавлення паяльної пасти. Застосовуються для поверхнево монтажу - SMT. Від прототипування - до багато серійного виробництва.",
        "bg_image": "../images/bg/machines/reflow/juki-reflow-baner.jpg"
    },
    {
        "id": "about-spi-data",
        "title": "Инспекция паяльной пасты - SPI",
        "uatitle": "Інспекція паяльної пасти - SPI",
        "desc": "Автоматическая оптическая инспекция качества нанесения паяльной пасты на контактные площадки печатных плат. Применяется в технологии поверхностного монтажа - SMT",
        "uadesc": "Автоматична оптична інспекція якості нанесення паяльної пасти на контактні площадки друкованих плат. Застосовується в технології поверхневого монтажу - SMT",
        "bg_image": "../images/bg/machines/smt/spi/machine-spi.png"
    },
    {
        "id": "about-aoi-data",
        "title": "Автоматическая оптическая инспекция - AOI",
        "uatitle": "Автоматична оптична інспекція - AOI",
        "desc": "Автоматическая оптическая инспекция (AOI) качества монтажа электронных компонентов на печатные платы. Применяется в технологии поверхностного монтажа – SMT.",
        "uadesc": "Автоматична оптична інспекція (AOI) якості монтажу електронних компонентів на друковані плати. Застосовується в технології поверхневого монтажу - SMT.",
        "bg_image": "../images/bg/machines/smt/aoi/machine-aoi.webp"
    },
    {
        "id": "about-conveyer-data",
        "title": "Перемещение печатных плат",
        "uatitle": "Переміщення друкованих плат",
        "desc": "Перемещение печатных плат в производственных линия для монтажа электронных компонентов на печатные платы.",
        "uadesc": "Переміщення друкованих плат в виробничих лінія для монтажу електронних компонентів на друковані плати.",
        "bg_image": "../images/bg/machines/smt/reflow/machine-reflow.png"
    },
    {
        "id": "about-selective-data",
        "title": "Селективная пайка",
        "uatitle": "Селективне паяння",
        "desc": "Монтаж электронных компонентов в отверстия печатных плат",
        "uadesc": "Монтаж електронних компонентів в отвори друкованих плат.",
        "bg_image": "../images/bg/machines/tht/inselective-baner.jpg"
    },
    {
        "id": "about-wave-data",
        "title": "Пайка волной припоя",
        "uatitle": "Пайка хвилею припою",
        "desc": "Монтаж электронных компонентов в отверстия печатных плат",
        "uadesc": "Монтаж електронних компонентів в отвори друкованих плат.",
        "bg_image": "../images/bg/machines/tht/entrywave-baner.jpg"
    },
    {
        "id": "about-cut-data",
        "title": "Разделение групповых заготовок",
        "uatitle": "Розділення групових панелей",
        "desc": "Автоматизация процессов разделения групповых заготовок печатных плат. Лазерная и фрезерная обработка плат. Бюджетное настольное оборудование",
        "uadesc": "Автоматизація процесів розділення групових панелей друкованих плат. Лазерна та фрезерна обробка плат. Бюджетне настільне обладнання",
        "bg_image": "../images/bg/machines/cutting/laser-baner.jpg"
    },
    {
        "id": "about-storage-data",
        "title": "Автоматизированные системы хранения",
        "uatitle": "Автоматизовані системи зберігання",
        "desc": "Автоматизированные склады для хранения электронных компонентов и другой комплектации. Сухое хранение электронных компонентов. Хранение паяльной пасты.",
        "uadesc": "Автоматизовані склади для зберігання електронних компонентів та іншої комплектації. Сухе зберігання електронних компонентів. Зберігання паяльної пасти.",
        "bg_image": "../images/bg/machines/storage/storage-baner.jpg"
    },
    {
        "id": "about-filtration-data",
        "title": "Автономные дымоулавливающие системы",
        "uatitle": "Автономні димоуловлювальні системи",
        "desc": "Автономные локальные вытяжные системы для оснащения производственного участка ручной пайки и лазерной обработки материалов",
        "uadesc": "Автономні локальні витяжні системи для оснащення виробничої дільниці ручного паяння та лазерної обробки матеріалів",
        "bg_image": "../images/bg/machines/filtration/filtration-baner.jpg"
    },
    {
        "id": "about-page-intro",
        "section_title": {
        "title": "We run all kinds of IT services that vow your <span>success</span>",
        "subtitle": "our company"
        },
        "heading": "<mark>38</mark> YEARS’ EXPERIENCE IN IT",
        "text": "More About Our Success Stories",
        "desc": "The IT services that Mitech are running can be segmented by the type of skills employed to deliver the service (design, build, run). Technically, these fall into three main categories: business process services, application services, and infrastructure services.",
        "path": "/it-services"
    },
    {
        "id": "about-page-resources",
        "title": "Get a copy of brochure on <span>Brand New IT Tech.</span>",
        "subtitle": "Resources",
        "download_link": "/about-us",
        "image": "../images/box-image/book-cover.png"
    },
    {
        "id": "about-page-solutions",
        "title": "We excel in delivering <br/> optimal solutions.",
        "solutions": [
            {
                "id": "warranty-management-it",
                "title": "Warranty Management IT",
                "text": "Our service offerings enhance customer experience throughout secure & highly functional end-to-end warranty management."
            },
            {
                "id": "product-engineering-services",
                "title": "Product Engineering & Services",
                "text": "Develop and propose product improvements through periodical and accurate testing, repairing & refining every version."
            },
            {
                "id": "quality-control-system",
                "title": "Quality Control System",
                "text": "It's more than a responsibility but a guarantee from us to gain customer trust with highly reliable quality control system."
            },
            {
                "id": "infrastructure-integration-technology",
                "title": "Infrastructure Integration Technology",
                "text": "At Mitech, we have a holistic and integrated approach towards core modernization to experience technological evolution."
            },
            {
                "id": "highly-professional-staffs",
                "title": "Highly Professional Staffs",
                "text": "Having obtained the official & formal training in IT technology and technical fields, our staffs know more than what they show."
            },
            {
                "id": "information-security-management",
                "title": "Information Security Management",
                "text": "Information security has been a rising issue lately due to a series of scandals from big companies, rest assured, we're here."
            }
        ]
    }
]