[
    {
        "id": "careers-section-intro-train",
        "title": "Техническое обучение по оборудованию и технологическим процессам. <span></span>"
    },
    {
        "id": "careers-section-intro-vacancy",
        "title": "Для активных и талантливых молодых и не молодых. <span></span>"
    },
    {
        "id": "our-open-jobs-train",
        "jobs": [
            {
                "id": "job-1",
                "title": "ОПЕРАТОРЫ",
                "type": "Эксплуатация",
                "description": "Техническое обучение по эксплуатации оборудования для операторов машин. Обучение охватывает оборудование от следующих производителей: монтаж компонентов - JUKI (SMT, THT, AOI, SPI), селективная пайка - INERTEC (CUBE.460, CUBE inline +), нанесение защитных покрытий – PVA (Delta 6, PVA350, Spectra), очистка – PBT Works (SuperSWASH, MiniSWASH)"
            },
            {
                "id": "job-2",
                "title": "ПРОГРАММИСТЫ",
                "type": "Программирование",
                "description": "Техническое обучение по подготовке рабочих программ для работы  оборудования. Обучение охватывает оборудование от следующих производителей: монтаж компонентов - JUKI (SMT, THT, AOI, SPI), селективная пайка - INERTEC (CUBE.460, CUBE inline +), нанесение защитных покрытий – PVA (Delta 6, PVA350, Spectra)."
            },
            {
                "id": "job-3",
                "title": "МЕХАНИКИ",
                "type": "Проведение ТО",
                "description": "Техническое обучение по подготовке специалистов для проведения технического обслуживания оборудования. Обучение охватывает оборудование от следующих производителей: монтаж компонентов - JUKI (SMT, THT, AOI, SPI), селективная пайка - INERTEC (CUBE.460, CUBE inline +), нанесение защитных покрытий – PVA (Delta 6, PVA350, Spectra), очистка – PBT Works (SuperSWASH, MiniSWASH)."
            }
        ]
    },
    {
        "id": "our-open-jobs-vacancy",
        "jobs": [
            {
                "id": "job-1",
                "title": "Инженер",
                "type": "Продажи",
                "description": "Инженер по продажам оборудования и материалов для производства электроники. Обязанности: составление предпродажной технической документации по ТЗ заказчика, предпродажная поддержка клиентов. Требования: техническое образование (связанное с электроникой), английский язык (чтение технической документации)."
            },
            {
                "id": "job-2",
                "title": "Инженер",
                "type": "Сервис",
                "description": "Инженер по сервису оборудования для производства электроники: оборудование для SMT, оборудование для селективного нанесения защитных покрытий, оборудование для селективной пайки, оборудование для оптической инспекции ( AOI, SPI), оборудование для мойки. Требование: опыт работы по ТО аналогичного оборудования, знание английского языка (необходимый уровень для прохождения обучения в Европе)."
            }
        ]
    },
    {
        "id": "our-office-views-train",
        "title": "Pay a visit & have some coffee!",
        "link": "/leadership",
        "images": [
            "../images/box-image/office-1.jpg",
            "../images/box-image/office-2.jpg",
            "../images/box-image/office-3.jpg",
            "../images/box-image/office-4.jpg"
        ]
    }
]